zeha/xc32/pic32c-source/binutils/ld/mchp/pic32c-emul.c
/* Linker emulation code for pic32c.

  This file is part of the GNU Binutils.

  This program is free software; you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation; either version 3 of the License, or
  (at your option) any later version.

  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with this program; if not, write to the Free Software
  Foundation, Inc., 51 Franklin Street - Fifth Floor, Boston,
  MA 02110-1301, USA. */

#include "sysdep.h"
#include "bfd.h"
#include "bfdlink.h"
#include "getopt.h"
#include "genlink.h"
#include "ld.h"
#include "ldmain.h"
#include "ldmisc.h"
#include "ldexp.h"
#include "ldlang.h"
#include "ldfile.h"
#include "ldctor.h"

#include "ldemul.h"
#include "libbfd.h"
#include "elf-bfd.h"
#include "elf/arm.h"
#include "elf/pic32.h"
#include "ctype.h"

#include <stdint.h>

#include "pic32c-utils.h"
#include "pic32-vecset.h"
#include "pic32-stack-usage.h"

#include "pic32c-options.h"
#include "pic32c-allocate.h"
#include "pic32-su-common.h"
#include "pic32-su-callstack.h"
#include "pic32c-emul.h"
#include "pic32c-emultempl.h"
#include "smartio.h"
#include "mchp/pic32-common-emul.h"
#include "pic32-debug.h"

#define DEBUG_SCOPE "bfa"

/* These functions are defined in other emulation files and are
   repeated here for simplicity. */

extern void pic32_print_su_report (FILE *);

/* controls code for supporting user memory region declarations by pragma.
   turning this on will require refactoring of the code to use the region_info
   structure. it's unclear if this feature will ever get ported. */
//#define ENABLE_USER_MEMORY 1
#undef ENABLE_USER_MEMORY

#undef DATA_RECORD_HEADER_SIZE
#define DATA_RECORD_HEADER_SIZE 12

/* FIXME: fix_cortex_a8 is disabled explicitly here. this may create a stub
   after allocation leading to a possible section overlap, and the stub creation
   is triggered by branches spanning a 4k page which is unpredictable.
   Turning it off now is okay because we do not support the cortex-a8 yet, even 
   though the fix will be applied for any armv7-a arch.
   If we do have to turn this on, it will require some care to ensure that 
   the BFA plays well with the code to add __stub sections for that fix. */
struct elf32_arm_params params =
{
  NULL,                         /* thumb_entry_symbol */
  0,                            /* byteswap_code */
  0,                            /* target1_is_rel (initialized by pic32c_before_parse) */ 
  NULL,                         /* target2_type (initialized by pic32c_before_parse)  */
  0,                            /* fix_v4bx */
  0,                            /* use_blx */
  BFD_ARM_VFP11_FIX_DEFAULT,    /* vfp11_denorm_fix */
  BFD_ARM_STM32L4XX_FIX_NONE,   /* stm32l4xx_fix */
  0,                            /* no_enum_size_warning */
  0,                            /* no_wchar_size_warning */
  0,                            /* pic_veneer */
  0,                            /* fix_cortex_a8 */
  1,                            /* fix_arm1176 */
  -1,                           /* merge_exidx_entries */
  0,                            /* cmse_implib */
  NULL                          /* in_implib_bfd */
};

char *in_implib_filename = NULL;
bfd_boolean detailed_mem_usage_to_map = FALSE;

lang_statement_union_type *pic32_last_os;




/* strings to save symbol names to be assigned to _stack and _splim respectively */
/* see ldexp.c                                                                   */
char *altNameforStack = NULL;
char *altNameforSplim = NULL;
/* and we need another set in case stack is in tcm ...                           */
char *altNamefor_dtcm_Stack = NULL;
char *altNamefor_dtcm_Splim = NULL;

/* helper(s) to deal with missing regions that pass region_lookup.
   these get a length of -1. the default region is expected to 
   have this length, so we handle it by name. */
int
valid_region (const lang_memory_region_type *region)
{
  return (
    region && (region->length > 0)
    && ((region->length != ~(bfd_size_type) 0)
	|| (strcmp (region->name_list.name, DEFAULT_MEMORY_REGION) == 0)));
}

static void
remove_section_from_bfd(bfd *abfd, asection *sec)
{
    asection *s, *prev;
    
    s = abfd->sections;
    if ((s == NULL) || (s->next == NULL)) return;
    
    /* as a sanity check, search for the section in the bfd */
    /* this can be removed or made optional if speed is an issue */
#if 1
    /* lookup 'sec' starting with 2nd bfd section (never remove the 1st one) */
    s = s->next;
    while (s != sec && s != NULL)
        s = s->next;
    /* didn't find it */
    if (s == NULL)
#else
    /* simple test for not removing the 1st section */
        if (sec->prev == NULL)
#endif
            return;
    
    prev = sec->prev;
    prev->next = sec->next;
    
    if (sec->next)
        sec->next->prev = prev;
    else
        abfd->section_last = prev; /*update the bfd->section_last field
                                    if the removed section is the
                                    last section.*/
    abfd->section_count -= 1;
    PIC32_DEBUG("    removing section %s", s->name);
    return;
} /* static void remove_section_from_bfd (...)*/




void
pic32c_before_parse (void)
{
  /* These params values were originally written directly into the
     structure definition but because they used shell expansion in the
     emulation file they need to be set here instead. */
  params.target1_is_rel = EMULTEMPL.target1_is_rel;
  params.target2_type = EMULTEMPL.target2_type;
#ifndef TARGET_                 /* I.e., if not generic.  */
  ldfile_set_output_arch (EMULTEMPL.arch, bfd_arch_unknown);
#endif /* not TARGET_ */
  input_flags.dynamic = EMULTEMPL.dynamic;
  config.has_shared = EMULTEMPL.has_shared;
  config.separate_code = EMULTEMPL.separate_code;
  link_info.relro = DEFAULT_LD_Z_RELRO;
}

void
pic32c_set_symbols (void)
{
  /* PR 19106: The section resizing code in gldarmelf_after_allocation
     is effectively the same as relaxation, so prevent early memory
     region checks which produce bogus error messages.
     Note - this test has nothing to do with symbols.  It is just here
     because this is the first emulation routine that is called after
     the command line has been parsed.  */
  if (!bfd_link_relocatable (&link_info))
    TARGET_ENABLE_RELAXATION;
}

void
arm_elf_before_allocation (void)
{

