zeha/xc32/pic32c-source/binutils/ld/mchp/pic32c-emul.c
  bfd_elf32_arm_set_byteswap_code (&link_info, params.byteswap_code);

  /* Choose type of VFP11 erratum fix, or warn if specified fix is unnecessary
     due to architecture version.  */
  bfd_elf32_arm_set_vfp11_fix (link_info.output_bfd, &link_info);

  /* Choose type of STM32L4XX erratum fix, or warn if specified fix is
     unnecessary due to architecture version.  */
  bfd_elf32_arm_set_stm32l4xx_fix (link_info.output_bfd, &link_info);

  /* Auto-select Cortex-A8 erratum fix if it wasn't explicitly specified.  */
  /* FIXME: see comment the params structure. */
#if 0
  bfd_elf32_arm_set_cortex_a8_fix (link_info.output_bfd, &link_info);
#endif

  /* Ensure the output sections of veneers needing a dedicated one is not
     removed.  */
  bfd_elf32_arm_keep_private_stub_output_sections (&link_info);

  /* We should be able to set the size of the interworking stub section.  We
     can't do it until later if we have dynamic sections, though.  */
  if (elf_hash_table (&link_info)->dynobj == NULL)
    {
      /* Here we rummage through the found bfds to collect glue information.  */
      LANG_FOR_EACH_INPUT_STATEMENT (is)
	{
          /* Initialise mapping tables for code/data.  */
          bfd_elf32_arm_init_maps (is->the_bfd);

	  if (!bfd_elf32_arm_process_before_allocation (is->the_bfd,
							&link_info)
	      || !bfd_elf32_arm_vfp11_erratum_scan (is->the_bfd, &link_info)
	      || !bfd_elf32_arm_stm32l4xx_erratum_scan (is->the_bfd,
							&link_info))
	    /* xgettext:c-format */
	    einfo (_("Errors encountered processing file %s"), is->filename);
	}

      /* We have seen it all.  Allocate it, and carry on.  */
      bfd_elf32_arm_allocate_interworking_sections (& link_info);
    }

  /* Call the standard elf routine.  */
  emultempl_before_allocation ();
}

/* Fake input file for stubs.  */
static lang_input_statement_type *stub_file;

/* stuff inserted for pic32c JLM */

/* Memory Reporting Info */
struct magic_section_description_tag {
 char *name;
 char *description;
};

struct magic_sections_tag
{
  const struct magic_section_description_tag *sections;
  unsigned int count;
  unsigned int index;
  unsigned int start;
};

bfd_boolean need_layout;

#ifdef ENABLE_USER_MEMORY
static void bfd_pic32_report_memory_sections
   (const char *, asection *, FILE *);
#endif

void bfd_pic32_report_memory_usage
   (FILE *);

extern void bfd_pic32_report_memory_usage_by_module
   (FILE *);

static void report_percent_used
   (bfd_vma, bfd_vma, FILE *);

void pic32_build_section_list
   (bfd *, asection *, PTR);

void pic32_build_section_list_vma
   (bfd *, asection *, PTR);


static struct pic32_section *  find_pic32_sec_from_bfd_section(struct pic32_section *, asection *);



bfd_boolean pic32_is_empty_list
   (struct pic32_section* const lst);
#if 0
static void pic32_init_section_list
   (struct pic32_section **);
#endif

#ifdef ENABLE_USER_MEMORY
static bfd_boolean pic32_name_in_section_list
   (struct pic32_section *, const char *);
#endif

static void bfd_pic32_finish
   (void);

void pic32_create_data_init_section_lists(void);

void pic32_find_data_code_sections(void);

void pic32_create_specific_fill_sections(void);

static void bfd_pic32_add_bfd_to_link
   (bfd *, const char *);

static void bfd_pic32_scan_data_section
(struct pic32_section*, PTR);

static void bfd_pic32_scan_code_section
   (struct pic32_section*, PTR);

static void pic32_strip_sections
  (bfd *);

static void pic32_merge_sections(void);
 
void pic32_append_section_to_list
   (struct pic32_section *, asection *);

static struct pic32_section *
pic32_copy_list (struct pic32_section *);

struct pic32_section *
pic32_copy_section (struct pic32_section *);

void pic32_free_section_list
   (struct pic32_section **);


int pic32_section_list_length
   (struct pic32_section *);

void pic32_print_section_list
   (struct pic32_section *, const char *);

void pic32_remove_from_section_list
   (struct pic32_section *, struct pic32_section *);

void pic32_remove_group_from_section_list
   (struct pic32_section *);

struct pic32_memory * pic32_static_assign_memory
   (struct pic32_memory *, bfd_vma, bfd_vma);

void pic32_add_to_memory_list
   (struct pic32_memory *, bfd_vma, bfd_vma);

void pic32_remove_from_memory_list
   (struct pic32_memory *, struct pic32_memory *);

int pic32_init_region_info
   (struct region_info *);

void pic32_free_region_info
   (struct region_info *);

#ifdef ENABLE_SERIAL_MEM
static int allocate_serial_memory
   (void);
#endif

#ifdef ENABLE_USER_MEMORY
static int allocate_user_memory
   (void);
#endif

void pic32_free_memory_list
   (struct pic32_memory **);

void pic32_init_memory_list
   (struct pic32_memory **);

bfd_boolean pic32_unique_section
   (const char *s);

static bfd_boolean bfd_pic32_process_bfd_after_open
   (bfd *, struct bfd_link_info *);

lang_memory_region_type *region_lookup
   (char *);

static bfd_size_type bfd_pic32_report_sections
   (struct pic32_section *, const lang_memory_region_type *,
           struct magic_sections_tag *, FILE *);

bfd_size_type bfd_pic32_collect_section_size
   (struct pic32_section *, const lang_memory_region_type *);

static const char * bfd_pic32_lookup_magic_section_description
   (const char *, struct magic_sections_tag *, const char **);

// coherent section processing functions

#ifdef ENABLE_COHERENT
static int locate_coherent_sections
   (unsigned int, struct memory_region_struct *);

static int coherent_section_count = 0;

static void pic32_remove_coherent_group_from_section_list
   (struct pic32_section *, unsigned int);
#endif

#ifdef TARGET_IS_PIC32C
  /* fill option definitions */
static bfd * bfd_pic32_create_fill_bfd
   (bfd *);

void pic32_create_fill_templates
   (void);

static void pic32_create_unused_program_sections
   (struct pic32_fill_option *);

void pic32_report_crypto_sections
  (void);

void bfd_pic32_memory_summary
  (char *);



/* lghica co-resident - to be reviewed*/
// keep it so stufff can compile ...

#define PIC32_CORESIDENT (BSF_WEAK)


