zeha/xc32/pic32c-source/binutils/ld/mchp/pic32c-emul.c
  /*
  ** check the input file name
  */
  if (!strcmp (abfd->filename, "sbrk.o"))
    {
      pic32_heap_required = 1;
    }

  /*
   ** loop through the symbols in this bfd
   */
  {
	pic32_symbol_list = bfd_pic32_fill_symbol_list(abfd);

    /*
     ** loop through the sections in this bfd
     */
    for (sec = abfd->sections; sec != 0; sec = sec->next)
      {
	/* if section has extended attributes, apply them */
	if (pic32_symbol_list)
	  {
	    int c;
	    for (c = 0; c < pic32_symbol_list->pic32_symbol_count; c++)
	      {
		if (strcmp (sec->name, pic32_symbol_list->syms[c].name) == 0)
		  pic32_set_extended_attributes (sec,
						 pic32_symbol_list->syms[c].value, 0);
	      }
	  }

	/* if section has HEAP attribute, record that fact */
	if (PIC32_IS_HEAP_ATTR (sec) && (sec->size > 0))
	  {
	    if (heap_section_defined)
	      einfo (_ ("%P%X: Error: Multiple heap sections defined\n"));
	    else
	      {
		heap_section_defined = TRUE;
		heap_bfd = sec->owner;
		if ((pic32c_heap_size > 0) && (pic32c_heap_size != (sec->size)))
		  einfo (_ ("%P%X: Error: Size of heap requested (%d bytes)"
			    " does not match heap defined in section \'%s\'"
			    "  (%d bytes)\n"),
			 pic32c_heap_size, sec->name, sec->size);
	      }
	  }

	flagword old_flags = sec->flags;

	/* process input section flags here, if necessary */
	if ((sec->flags & (SEC_ALLOC | SEC_LOAD | SEC_DATA))
	    == (SEC_ALLOC | SEC_LOAD | SEC_DATA))
	  sec->flags |= SEC_HAS_CONTENTS; /* elf linker needs this */

	/* report if flags were changed */
	if (sec->flags != old_flags)
	  PIC32_DEBUG("   adjust flags: %s %x --> %x", sec->name,
		      old_flags, sec->flags);
      }

    if (symbols)
      free (symbols);
	if (pic32_symbol_list && has_extended_attributes) {
	  free(pic32_symbol_list->syms);
	  free(pic32_symbol_list);
	}
    return TRUE;
  }
}

void
pic32_find_data_code_sections(void)
{
  /*
   * Loop through all input sections and
   * build a list of DATA or BSS type, and identifying which require
   * initialization.
   */

  asection *sec;
  LANG_FOR_EACH_INPUT_STATEMENT (f)
    {
      for (sec = f->the_bfd->sections; sec != (asection *) NULL;
           sec = sec->next)
        {
          if (((sec->size > 0) && (sec->linked == 0)
               && (PIC32_IS_DATA_ATTR (sec)))
              || (PIC32_IS_BSS_ATTR (sec)) || PIC32_IS_RAMFUNC_ATTR (sec)
              || ((sec->size > 0)
                  && (PIC32_IS_DATA_ATTR_WITH_MEMORY_ATTR (sec)))
              || (PIC32_IS_BSS_ATTR_WITH_MEMORY_ATTR (sec)))
            pic32_append_section_to_list (data_sections, sec);
          else if ((sec->size > 0) && PIC32_IS_CODE_ATTR (sec))
            pic32_append_section_to_list (code_sections, sec);
        }
    }
}

void
pic32_create_data_init_section_lists(void)
{
  /* init list of input data sections */
  pic32_init_section_list (&data_sections);

  /* init list of input code sections */
  pic32_init_section_list (&code_sections);
}

/* Create the .dinit section describing sections that require
   runtime relocation/initialization, e.g. are located in an output
   region that is not loaded.
*/
void
pic32_create_data_init_template(void)
{
  struct pic32_section *s;
  int total_data = 0;
  asection *sec;

  /*
  ** If data init support is enabled, create a BFD
  ** for section .dinit and add it to the link.
  */
  if (!pic32_data_init)
    {
      init_bfd = NULL;
      init_data = NULL;
    }
  else
    {
      init_bfd = bfd_pic32_create_data_init_bfd (link_info.output_bfd);
      bfd_pic32_add_bfd_to_link (init_bfd, init_bfd->filename);
    }

  /* Compute size of data init template */
  for (s = data_sections; s != NULL; s = s->next)
    if ((s->sec) && ((s->sec->flags & SEC_EXCLUDE) == 0))
      bfd_pic32_scan_data_section (s, &total_data);

  ///\ place in dinit .text sections that should run from itcm
  for (s = code_sections; s != NULL; s = s->next)
    {
      if ((s->sec) && ((s->sec->flags & SEC_EXCLUDE) == 0))
        {
          if ((pic32c_relocate_vectors)
              && (strstr (s->sec->name, ".vectors") != NULL))
            {
              total_data
                += ((s->sec->size % 4) ? (s->sec->size + (4 - s->sec->size % 4))
                    : s->sec->size)
                + DATA_RECORD_HEADER_SIZE;

              /* indicate this will be in template (scan_code_section
                 normally sets this) */
              s->sec->init = 1;
              s->sec->flags &= ~SEC_LOAD;

              PIC32_DEBUG("marking .vectors as requiring initialization");
            }
          else if (s->sec->itcm)
            bfd_pic32_scan_code_section (s, &total_data);
        }
    }

  total_data += 8; /* zero terminated -> 64-bit value*/

  if (total_data % 16)
    init_data_padding += 16 - (total_data % 16);
  total_data += init_data_padding;

  DEBUG({
      pic32_print_section_list (data_sections, "data sections after scan");
      pic32_print_section_list (code_sections, "code sections after scan");
    });
  
  /* bail out having scanned all sections if dinit is disabled. */
  if (!pic32_data_init)
    {
      PIC32_DEBUG("skipping .dinit creation (--no-data-init)");
      return;
    }

  dinit_size = total_data;

  PIC32_DEBUG("optim_dinit dinit_size %d", total_data);

  /* allocate memory for the template */
  init_data = (unsigned char *) bfd_alloc (link_info.output_bfd, total_data);

  if (!init_data)
    {
      fprintf (stderr, "Link Error: not enough memory for data template\n");
      abort ();
    }

  /* fill the template with a default value */
  init_data = memset (init_data, 0x11, total_data);

  /* attach it to the input section */
  sec = bfd_get_section_by_name (init_bfd, ".dinit");

  if (!sec)
    {
      /* FIXME: is an error appropriate here? */
      PIC32_DEBUG("after_open: section .dinit not found");
    }
  else
    {
      sec->size = total_data;
      sec->flags |= (SEC_HAS_CONTENTS | SEC_IN_MEMORY | SEC_LOAD | SEC_CODE
                     | SEC_KEEP | SEC_READONLY);
      sec->contents = init_data;
      bfd_set_section_size (init_bfd, sec, total_data);
      init_template = sec; /* save a copy for later */

