zeha/xc32/pic32c-source/binutils/ld/mchp/pic32c-emul.c
      if (pic32_dinit_has_absolute_address)
        {
          bfd_set_section_vma (init_bfd, sec, dinit_address);
          PIC32_SET_ABSOLUTE_ATTR (sec);
        }
    }
}

/*
** Create a bfd for the stack
**
** Uses the following global variables:
**   symtab
**   symptr
**   pic32c_stack_size
*/
static bfd *
bfd_pic32_create_stack_bfd (bfd *parent) {
  bfd_size_type size;
  bfd *abfd;
  asection *sec;
  char *oname;
  int flags, align;

  /* create a bare-bones bfd */
  oname = (char *) xmalloc (20);
  sprintf (oname, "stack");
  abfd = bfd_create (oname, parent);
  bfd_find_target (EMULTEMPL.output_format, abfd);
  bfd_make_writable (abfd);

  bfd_set_format (abfd, bfd_object);
  bfd_set_arch_mach (abfd, bfd_arch_arm, 0);

  /* create a symbol table (room for 1 entry) */
  symptr = 0;
  symtab = (asymbol **) xmalloc (2 * sizeof (asymbol *));

  /* create a bare-bones section */
  flags = SEC_LINKER_CREATED | SEC_KEEP;
  align = 1;
  sec = bfd_pic32_create_section (abfd, ".stack", flags, align);
  bfd_set_section_flags (abfd, sec, flags);
  size = 8;
  bfd_set_section_size (abfd, sec, size);

  /* put in the symbol table */
  bfd_set_symtab (abfd, symtab, symptr);

  /* finish it */
  if (!bfd_make_readable (abfd)) {
      fprintf( stderr, "Link Error: can't make stack readable\n");
      abort();
    }
  /* set section flags & attributes again, because the call to
     bfd_make_readable() loses them */
     sec = abfd->sections;
     flags = SEC_LINKER_CREATED | SEC_KEEP;
     bfd_set_section_flags (abfd, sec, flags);
  return abfd;
} /* static bfd * bfd_pic32_create_stack_bfd (...)*/




// add a new stub section to the list of pic32 sections we are keeping
//   after_input_section is the section that caused the stub to be required
static void pic32_add_stub_to_master_copy(asection *after_input_section, asection *new_stub) {


    struct pic32_section *anchor;
    
    if (after_input_section == NULL) {
	/* we should not ever get here ... after_input_section should never be NULL */
	pic32_append_section_to_list(unassigned_sections_master_copy, new_stub);
    }
    // bail if it isn't one of ours
    else if (after_input_section->bfa == FALSE) {
	return;
    }
    else {
        anchor = find_pic32_sec_from_bfd_section(unassigned_sections_master_copy, after_input_section);
	if (anchor == NULL) einfo ("%F Stub %s added after section we can't find: %E\n", new_stub->name);
	
	PIC32_DEBUG("Adding stub %s of size %d alignment %d to section %s",
		    new_stub->name,
		    new_stub->size,
		    new_stub->alignment_power,
		    anchor->sec->name);
	if (NULL == anchor->children) pic32_init_section_list(&anchor->children);
	

	/* if anchor is a ramfunc section then we need to mark the stub the same
	   way and increment the size of dinit        */

	if (anchor->sec && (PIC32_IS_RAMFUNC_ATTR(anchor->sec))) 
	      PIC32_SET_RAMFUNC_ATTR(new_stub);
	if (anchor->sec && (PIC32_IS_ITCM_ATTR(anchor->sec))) 
	      PIC32_SET_ITCM_ATTR(new_stub);
	if (anchor->sec && (PIC32_IS_NOPA_ATTR(anchor->sec))) 
	    PIC32_SET_NOPA_ATTR(new_stub);
	if (anchor->sec->init) new_stub->init =1;
	/* SEC_KEEP causes trouble with pic32c-valid-attributes so if the anchor doesn't have it remove it from the stub */
	/* fixme: this is not a great long-term thing */
	if ((anchor->sec->flags & SEC_KEEP)==0) new_stub->flags = new_stub->flags & ~SEC_KEEP;

	/* for alignment propagate it upwards if needed ... */
	if (new_stub->alignment_power > anchor->sec->alignment_power) anchor->sec->alignment_power = new_stub->alignment_power;

	pic32_append_section_to_list(anchor->children, new_stub);
        /* and add  it to code_sections so that dinit can see it */
	pic32_append_section_to_list(code_sections, new_stub);
	


    }
}




/* Call-back for elf32_arm_size_stubs.  */

/* Create a new stub section, and arrange for it to be linked
   immediately after INPUT_SECTION.  */

static asection *
elf32_arm_add_stub_section (const char * stub_sec_name,
			    asection *   output_section,
			    asection *   after_input_section,
			    unsigned int alignment_power)
{
  asection *stub_sec;
  flagword flags;
  lang_output_section_statement_type *os;
  struct hook_stub_info info;


  flags = (SEC_ALLOC | SEC_LOAD | SEC_READONLY | SEC_CODE
	   | SEC_HAS_CONTENTS | SEC_RELOC | SEC_IN_MEMORY | SEC_KEEP);
  stub_sec = bfd_make_section_anyway_with_flags (stub_file->the_bfd,
						 stub_sec_name, flags);
  if (stub_sec == NULL)
    goto err_ret;

  bfd_set_section_alignment (stub_file->the_bfd, stub_sec, alignment_power);

  os = lang_output_section_get (output_section);

  info.input_section = after_input_section;
  lang_list_init (&info.add);
  lang_add_section (&info.add, stub_sec, NULL, os);

  if (info.add.head == NULL)
    goto err_ret;

  // add this stub to the list of pic32 sections we are keeping 
  pic32_add_stub_to_master_copy(after_input_section, stub_sec);

  
  if (after_input_section == NULL)
    {
      lang_statement_union_type **lp = &os->children.head;
      lang_statement_union_type *l, *lprev = NULL;

      for (; (l = *lp) != NULL; lp = &l->header.next, lprev = l);

      if (lprev)
	lprev->header.next = info.add.head;
      else
	os->children.head = info.add.head;

      return stub_sec;
    }
  else
    {
      if (hook_in_stub (&info, &os->children.head))
	return stub_sec;
    }

 err_ret:
  einfo ("%X%P: can not make stub section: %E\n");
  return NULL;
}

/* Another call-back for elf_arm_size_stubs.  */

static void
arm_layout_sections_again (void)
{
  /* If we have changed sizes of the stub sections, then we need
     to recalculate all the section offsets.  This may mean we need to
     add even more stubs.  */
  emultempl_map_segments (TRUE);
  need_laying_out = -1;
}

static void
build_section_lists (lang_statement_union_type *statement)
{
  if (statement->header.type == lang_input_section_enum)
    {
      asection *i = statement->input_section.section;

      if (i->sec_info_type != SEC_INFO_TYPE_JUST_SYMS
	  && (i->flags & SEC_EXCLUDE) == 0
	  && i->output_section != NULL
	  && i->output_section->owner == link_info.output_bfd)
	elf32_arm_next_input_section (& link_info, i);
    }
}

static int
compare_output_sec_vma (const void *a, const void *b)
{
  asection *asec = *(asection **) a, *bsec = *(asection **) b;
  asection *aout = asec->output_section, *bout = bsec->output_section;
  bfd_vma avma, bvma;

  /* If there's no output section for some reason, compare equal.  */
  if (!aout || !bout)
    return 0;

