zeha/xc32/pic32c-source/binutils/ld/mchp/pic32c-emul.c
  avma = aout->vma + asec->output_offset;
  bvma = bout->vma + bsec->output_offset;


  if (avma > bvma)
    return 1;
  else if (avma < bvma)
    return -1;

  return 0;
}


/*
 * This routine is called after allocate_memory when dinit is 
 * disabled, and is responsible for warning if a section 
 * will not be initialized.
 *
 * This effectively means any section placed by the BFA requiring initialization,
 * rather than anything modified by the script. 
 */
static void
pic32_warn_if_dinit_needed (struct pic32_section *section)
{
  if (section->sec && section->sec->bfa && section->sec->init)
    {
      einfo (_ (
	       "%P: warning: automatic data initialization has been turned off,"
	       " section %s will not be initialized using .dinit template.\n"),
	     section->sec->name);
    }
}




/* Stuff for checking for overlap.  This is substantially copied from
   lang_check_section_addresses in ldlang.c 
   We are doing less here - we are only returning a boolean value indicating if 
   any sections overlap.  We are not printing any error message, we will try to
   reallocate.
*/

struct check_sec
{
  asection *sec;
};

static int
sort_sections_by_lma (const void *arg1, const void *arg2)
{
  const asection *sec1 = ((const struct check_sec *) arg1)->sec;
  const asection *sec2 = ((const struct check_sec *) arg2)->sec;

  if (sec1->lma < sec2->lma)
    return -1;
  else if (sec1->lma > sec2->lma)
    return 1;
  else if (sec1->id < sec2->id)
    return -1;
  else if (sec1->id > sec2->id)
    return 1;

  return 0;
}

static int
sort_sections_by_vma (const void *arg1, const void *arg2)
{
  const asection *sec1 = ((const struct check_sec *) arg1)->sec;
  const asection *sec2 = ((const struct check_sec *) arg2)->sec;

  if (sec1->vma < sec2->vma)
    return -1;
  else if (sec1->vma > sec2->vma)
    return 1;
  else if (sec1->id < sec2->id)
    return -1;
  else if (sec1->id > sec2->id)
    return 1;

  return 0;
}

/* debug display stuff JLM */

void display_bfd_section(asection*);
void display_bfd_section(asection *s){
    if (s==NULL) return;
    LOG("os %s lma %X size %d ",s->name,s->lma,s->size);
    if (s->output_section != NULL) LOG( "w/ os %s lma %X size %d ",s->output_section->name,s->output_section->lma,s->output_section->size);
    LOG("\n");
}

void display_output_section_statement(lang_statement_union_type*, int);
void display_output_section_statement(lang_statement_union_type *oss, int indent){
  lang_statement_union_type *l;
  for ( l = oss;l != NULL; l = l->header.next)
    
    switch (l->header.type)
	{
	case lang_output_section_statement_enum:
	  {
	    lang_output_section_statement_type osst = l->output_section_statement;
	    LOG("%d: oss %s has output section   ",indent, osst.name);
	    display_bfd_section(osst.bfd_section);
	    display_output_section_statement(osst.children.head, indent+1);
	    break;
	  }
	case lang_input_section_enum:
	    LOG("%d: input section: ",indent);
	    display_bfd_section(l->input_section.section);
	    break;
	case lang_wild_statement_enum:
	    LOG("%d: found a wild one \n",indent);
	    display_output_section_statement(l->wild_statement.children.head, indent+1);	    
	    break;
	case lang_constructors_statement_enum:
	    LOG("%d: found a ctor one \n",indent);
	    display_output_section_statement(constructor_list.head, indent+1);	    
	    break;
	case lang_group_statement_enum:
	    LOG("%d: found a group one \n",indent);
	    display_output_section_statement(l->group_statement.children.head, indent+1);	    
	    break;
	    
	case lang_input_statement_enum:
	    LOG("%d: found an input statement for %s \n",indent,l->input_statement.filename);
	    break;
	case lang_padding_statement_enum:
	    LOG("%d: found a padding statement %d bytes \n",indent,l->padding_statement.size);
	    break;

	case lang_data_statement_enum:
	case lang_reloc_statement_enum:
	case lang_object_symbols_statement_enum:
	case lang_output_statement_enum:
	case lang_target_statement_enum:
	case lang_assignment_statement_enum:
	case lang_address_statement_enum:
	case lang_fill_statement_enum:
	    LOG("%d: found a weird one %d \n",indent,l->header.type);
	    break;
	default:
	    FAIL ();
	    break;
	}
}
  


void display_output_section_statements(char*);
void display_output_section_statements(char *msg){
    lang_statement_union_type *oss =   lang_output_section_statement.head;
    LOG("Output section statements at %s \n",msg);
    display_output_section_statement(oss,0);
}
/* debug display routimes commented out
void pic32_display_output_bfd(char *);
void pic32_display_output_bfd(char * title){

    asection *s;
    int count = 0;
    LOG("output bfd at %s \n",title);
    for (s = link_info.output_bfd->sections; s != NULL; s = s->next)
	{
	    printf ("%s : %d :: ",s->name,s->size);
	    count++;
	}

    LOG("\n %d sections \n");
}
*/




bfd_boolean pic32_sections_overlap(void);

bfd_boolean pic32_sections_overlap(void){

  asection *s, *p;
  struct check_sec *sections;
  size_t i, count;
  bfd_vma s_start;
  bfd_vma s_end;
  bfd_vma p_start = 0;
  bfd_vma p_end = 0;
  bfd_boolean overlays;
  count = bfd_count_sections (link_info.output_bfd);
  if (count <= 1) return FALSE;
  sections = XNEWVEC (struct check_sec, count);

  /* Scan all sections in the output list.  */
  count = 0;
  for (s = link_info.output_bfd->sections; s != NULL; s = s->next)
    {
      if ((s->flags & SEC_ALLOC) == 0
          || s->size == 0)
        continue;

      sections[count].sec = s;
      count++;
    }

  if (count <= 1)
    {
      free (sections);
      return FALSE;
    }

  qsort (sections, count, sizeof (*sections), sort_sections_by_lma);
  /* First check section LMAs.  There should be no overlap of LMAs on
     loadable sections, even with overlays.  */

  for (p = NULL, i = 0; i < count; i++)
    {
      s = sections[i].sec;
      if ((s->flags & SEC_LOAD) != 0)
        {
          s_start = s->lma;
          s_end = s_start +  (s->size) - 1;

          /* Look for an overlap.  We have sorted sections by lma, so
             we know that s_start >= p_start.  Besides the obvious
             case of overlap when the current section starts before
             the previous one ends, we also must have overlap if the
             previous section wraps around the address space.  */
          if (p != NULL
              && (s_start <= p_end
                  || p_end < p_start))
            {
	      /* overlap has been detected */
	      return TRUE;
            }
          p = s;
          p_start = s_start;
          p_end = s_end;
        }
    }
    /* If any non-zero size allocated section (excluding tbss) starts at
     exactly the same VMA as another such section, then we have
     overlays.  Overlays generated by the OVERLAY keyword will have
     this property.  It is possible to intentionally generate overlays
     that fail this test, but it would be unusual.  */
  qsort (sections, count, sizeof (*sections), sort_sections_by_vma);
  overlays = FALSE;
  p_start = sections[0].sec->vma;
  for (i = 1; i < count; i++)
    {
      s_start = sections[i].sec->vma;
      if (p_start == s_start)
        {
          overlays = TRUE;
          break;
        }
      p_start = s_start;
    }

