zeha/xc32/pic32c-source/binutils/ld/mchp/pic32c-emul.c
  /* Now check section VMAs if no overlays were detected.  */
  if (!overlays)
    {
      for (p = NULL, i = 0; i < count; i++)
        {
          s = sections[i].sec;
          s_start = s->vma;
          s_end = s_start + (s->size) - 1;

          if (p != NULL
              && (s_start <= p_end
                  || p_end < p_start))
	      return TRUE;
          p = s;
          p_start = s_start;
          p_end = s_end;
        }
    }

  free (sections);
  return FALSE;

     
}







static void pic32_deallocate_sections(struct pic32_section*);

/* recursively remove the output sections associated with a list of pic32_sections
   (and their children)   */

static void pic32_deallocate_sections(struct pic32_section* lst){
    struct pic32_section  *s;
    
    for (s = lst ; s != NULL ; s = s->next) {
	
	if (NULL != s->sec) {
	    if (s->sec->output_section) {
		/* Unlink the section.  */
		s->sec->output_section = NULL;
		if (!PIC32_IS_ABSOLUTE_ATTR(s->sec)){
		    s->sec->vma = 0;
		    s->sec->lma = 0;
		}
	    }
	    if (NULL != s->children){
		pic32_deallocate_sections(s->children);
	    }
	}
    }
}

static void pic32_discard_previous_bfa_allocation(void);

static void pic32_discard_previous_bfa_allocation(){

    lang_statement_union_type *os, *next;
    PIC32_DEBUG("Discarding the output section statements created by the bfa:");

    /* unlink all the output_section statements that follow pic32_last_os */

    for (os =  pic32_last_os;
         os != (lang_statement_union_type *) NULL;) {
        next = os->header.next;
	/* remove next, and its output bfd_section */
	if (NULL == next) break;
	if (next->header.type == lang_output_section_statement_enum) {
	    PIC32_DEBUG("discarding %s", next->output_section_statement.name);
	    /* unlink the oss pointed to by next */
	    if (!(os->header.next = next->header.next))
		/* update statement_list.tail if we just removed/merged the last stmt */
		stat_ptr->tail = &os->header.next;
	    
	    /* there's another (doubly) linked list containing only the output section */
	    /* statements so also update its links and the tail address when the last */
	    /* output statement is removed / merged */
	    if (!(os->output_section_statement.next = next->output_section_statement.next))
		lang_output_section_statement.tail = (union lang_statement_union **) &os->output_section_statement.next;
	    else
		os->output_section_statement.next->prev = (struct lang_output_section_statement_struct *) os;
	    next = os->header.next;	    
	}
	else {
	    LOG("we found a non-oss \n");
	}

    }
    /* next blow through the output bfd and ditch any sections that were added by the bfa
     * this code assumes that the first output section in the output bfd is not from the bfa
     */
    asection *s,*prev;
    prev = link_info.output_bfd->sections;
    for (s = link_info.output_bfd->sections; s != NULL; s = s->next){
	if(s->bfa) {
	    prev = s->prev;
	    prev->next = s->next;
	    
	    if (s->next)
		s->next->prev = prev;
	    else
		 link_info.output_bfd->section_last = prev; /*update the bfd->section_last field
					     if the removed section is the
					     last section.*/
	    link_info.output_bfd->section_count -= 1;
	    s = prev;
	}
    }


    
    /* then look at the input sections we need to reallocate
     and make then look un-allocated  */
    pic32_deallocate_sections(unassigned_sections);

 
}




void
pic32c_after_allocation (void)
{
  int ret;
  //  int tries_remaining = 0;
  bfd_boolean sections_overlap;

  /* Build a sorted list of input text sections, then use that to process
     the unwind table index.  */
  unsigned int list_size = 10;
  asection **sec_list = (asection **)
    xmalloc (list_size * sizeof (asection *));
  unsigned int sec_count = 0;

  LANG_FOR_EACH_INPUT_STATEMENT (is)
    {
      bfd *abfd = is->the_bfd;
      asection *sec;

      if ((abfd->flags & (EXEC_P | DYNAMIC)) != 0)
	continue;

      for (sec = abfd->sections; sec != NULL; sec = sec->next)
	{
	  asection *out_sec = sec->output_section;

	  if (out_sec
	      && elf_section_data (sec)
	      && elf_section_type (sec) == SHT_PROGBITS
	      && (elf_section_flags (sec) & SHF_EXECINSTR) != 0
	      && (sec->flags & SEC_EXCLUDE) == 0
	      && sec->sec_info_type != SEC_INFO_TYPE_JUST_SYMS
	      && out_sec != bfd_abs_section_ptr)
	    {
	      if (sec_count == list_size)
		{
		  list_size *= 2;
		  sec_list = (asection **)
		    xrealloc (sec_list, list_size * sizeof (asection *));
		}

	      sec_list[sec_count++] = sec;
	    }
	}
    }

  qsort (sec_list, sec_count, sizeof (asection *), &compare_output_sec_vma);

  if (elf32_arm_fix_exidx_coverage (sec_list, sec_count, &link_info,
				    params.merge_exidx_entries))
    need_laying_out = 1;

  free (sec_list);


      
  // stuff added here for best fit allocator

  // make a copy of the unassigned sections list to go back to if we need it 
  unassigned_sections_master_copy = pic32_copy_list(unassigned_sections);
  
  
  sections_overlap = TRUE;
  
  /*
  ** Invoke the best-fit allocator
  */
  
  //display_output_section_statements("before first allocation");
  
  if (pic32_allocate)
    {
      /* save aside the last output section statement
	 after sequential allocation
	 we will need it for merging sections and we may need it for reallocation */      
      pic32_last_os = lang_output_section_statement.head;
      /* pic32_last_os points at the last non-null output sections statement  */
      for(; pic32_last_os->header.next !=NULL;pic32_last_os = pic32_last_os->header.next) {};

      allocate_memory ();
    }
  //display_output_section_statements("after first allocation");
  
  
  /* If dinit is turned off, warn if we placed any sections requiring
   * initialization. */
  if (!pic32_data_init)
      {
	   struct pic32_section *s;
	   
	   for (s = data_sections; s != NULL; s = s->next)
	       pic32_warn_if_dinit_needed (s);
	   
	   for (s = code_sections; s != NULL; s = s->next)
	       pic32_warn_if_dinit_needed (s);
       }
   
