zeha/xc32/pic32c-source/binutils/ld/mchp/pic32c-emul.c
   /* bfd_elf32_discard_info just plays with debugging sections,
      ie. doesn't affect any code, so we can delay resizing the
      sections.  It's likely we'll resize everything in the process of
      adding stubs.  */
   ret = bfd_elf_discard_info (link_info.output_bfd, & link_info);
   if (ret < 0)
       {
	   einfo ("%X%P: .eh_frame/.stab edit: %E\n");
	   return;
       }
   else if (ret > 0)
       need_laying_out = 1;


   /* If generating a relocatable output file, then we don't
      have to examine the relocs.  */
   if (stub_file != NULL && !bfd_link_relocatable (&link_info))
       {
	   ret = elf32_arm_setup_section_lists (link_info.output_bfd, &link_info);

	   if (ret != 0)
	       {
		   if (ret < 0)
		       {
			   einfo ("%X%P: could not compute sections lists for stub generation: %E\n");
			   return;
		       }
		   
		   lang_for_each_statement (build_section_lists);

		   
		   /* Call into the BFD backend to do the real work.  */
		   if (! elf32_arm_size_stubs (link_info.output_bfd,
					       stub_file->the_bfd,
					       & link_info,
					       group_size,
					       & elf32_arm_add_stub_section,
					       & arm_layout_sections_again))
		       {
			   einfo ("%X%P: cannot size stub section: %E\n");
			   return;
		       }
	       }
       }



      if (need_laying_out != -1) {
	  // readjust the sections assigned by the vanilla linker ...
	  emultempl_map_segments (TRUE);

      }

      /*  do we need to do it all over again because we added some stubs?  */
      sections_overlap = pic32_sections_overlap();

      if (pic32_allocate && sections_overlap) {

	  // we start by copying the master copy of unassigned sections back over to the working copy so we can start again ...
	  unassigned_sections = pic32_copy_list(unassigned_sections_master_copy);

	  // remove the output sections created by the bfa ...

	  pic32_discard_previous_bfa_allocation();
          //display_output_section_statements("after discard");

	  
	  // resize dinit to account for any ramfunc stubs ...

	  estimate_dinit_optim(&link_info);
	  //fill_dinit_section(&link_info);
	 
 	  
	  // reallocate sections previously allocated by the bfa ..
	  allocate_memory();

	  //display_output_section_statements("after second allocation");
	  
	  	  
      }

      
      sections_overlap = pic32_sections_overlap(); 
      if (sections_overlap)
	  PIC32_DEBUG(" sections still overlap!"); //report link error!
      
      /*
       * try to merge consecutive sections with identical flags
       */
      pic32_merge_sections();
      /*
       * at this point we have a final allocation and we will not try any more reallocation
       */
      lang_reset_memory_regions ();
      lang_size_sections (NULL, ! RELAXATION_ENABLED);

      /*
      ** remove output sections with size = 0
      */
      pic32_strip_sections(link_info.output_bfd);
      
      
      if (pic32_has_fill_option)
	  pic32_create_fill_templates();
}

/*
** Return a pointer to bfd_link_hash_entry
** if a global symbol is defined;
** else return zero.
*/
struct bfd_link_hash_entry *
bfd_pic32_is_defined_global_symbol (name)
     const char *const name;
{
    struct bfd_link_hash_entry *h;
    h = bfd_link_hash_lookup (link_info.hash, name, FALSE, FALSE, TRUE);

    if ((h != (struct bfd_link_hash_entry *) NULL) &&
        (h->type == bfd_link_hash_defined))
      return h;
    else
      return (struct bfd_link_hash_entry *) NULL;
}

static bfd_boolean is_cmse_implib (void)
{
  return (params.cmse_implib == 1);
}


bfd_boolean (*mchp_is_cmse_implib)(void) = is_cmse_implib;

/*
** Create a bfd for the fill templates
**
** Uses the following global variables:
**   symtab
**   symptr
*/
static bfd *
bfd_pic32_create_fill_bfd (bfd *parent ATTRIBUTE_UNUSED)
{
  bfd_size_type size;
  bfd *abfd;
  asection *sec;
  char *oname;
  int flags, sec_align;
  const char *sname;

  /* create a bare-bones bfd */
  oname = (char *) bfd_alloc (link_info.output_bfd, 20);
  sprintf (oname, "fill%d", fill_section_count);
  abfd = bfd_create (oname, parent);
  bfd_find_target (EMULTEMPL.output_format, abfd);
  bfd_make_writable (abfd);

  bfd_set_format (abfd, bfd_object);
  bfd_set_arch_mach (abfd, bfd_arch_arm, 0);

  /* create a symbol table (room for 1 entry) */
  symptr = 0;
  symtab = (asymbol **) bfd_alloc (link_info.output_bfd, 2 * sizeof (asymbol *));

  /*
  ** create a bare-bones section for
  */
  /* get unique section name */
  /* probably not readonly? */
  sname = bfd_get_unique_section_name (abfd, "fill$", &fill_section_count);
  flags = SEC_CODE | SEC_HAS_CONTENTS | SEC_IN_MEMORY | SEC_KEEP |
          SEC_LINKER_CREATED;
  sec_align = 0; 
  sec = bfd_pic32_create_section (abfd, sname, flags, sec_align);
  size = 0; /* will update later */
  bfd_set_section_size (abfd, sec, size);

  /* put in the symbol table */
  bfd_set_symtab (abfd, symtab, symptr);
  /* finish it */
  if (!bfd_make_readable (abfd))
    {
      fprintf( stderr, "Link Error: can't make fill readable\n");
      abort();
    }
  return abfd;
} /* static bfd * bfd_pic32_create_fill_bfd (...)*/



/*
** Append a section to a list
*/
void
pic32_append_section_to_list (struct pic32_section *lst,
                              asection *sec)
{
  struct pic32_section *s, *tail, *new;

  if (!(lst))
    return;
  /* create a new element */
  new = ((struct pic32_section *)
         xmalloc(sizeof(struct pic32_section)));
  new->next  = 0;
  new->sec  = sec;
  new->pic32_size = sec->size;
  new->attributes = pic32_attribute_map(sec);
  new->file = NULL;
  new->children = NULL;
  new->use_vma = 0;
  new->region = NULL;
  new->dinit_type = -1;

  /* find the tail */
  for (s = lst; s != NULL; s = s->next)
    tail = s;

  tail->next = new;  /* add it */
}

/*
** add up the sizes of a list of pic32_sections
*/
bfd_size_type pic32_add_sizes (struct pic32_section *);


bfd_size_type pic32_add_sizes (struct pic32_section *lst) {

    if (lst == NULL) return 0;
    bfd_size_type total = 0;
    struct pic32_section *s;
    for (s = lst; s != NULL; s = s->next) total+= s->pic32_size;
    return total;
}

