zeha/xc32/pic32c-source/binutils/ld/mchp/pic32c-emul.c
/*
** make a copy of a single pic32_section
** the pic32_sections are recreated but we do not copy the bfd sections ...
*/

struct pic32_section * pic32_copy_section (struct pic32_section *src){
    struct pic32_section *new = ((struct pic32_section *)
				 xmalloc(sizeof(struct pic32_section)));
    if (NULL == new) {
	fprintf( stderr, "Fatal Error: Could not build section list\n");
	abort();
    }
    new->sec  = src->sec;
    new->attributes = src->attributes;
    new->file = src->file;
    new->use_vma = src->use_vma;
    new->region = src->region;
    new->pic32_size = src->pic32_size;
    new->children = NULL;
    new->next = NULL;
    if (src->children == NULL)
	return new;
    struct pic32_section *prev = NULL;
    for (struct pic32_section *curr = src->children;
	 curr != NULL;
	 curr = curr->next)
	{
	    struct pic32_section *newchild = pic32_copy_section (curr);
	    if (new->children == NULL)
		new->children = newchild;
	    else
		prev->next = newchild;
	    prev = newchild;
	}
    return new;
}

/*
struct pic32_section * pic32_copy_section (struct pic32_section *src){

    struct pic32_section *new = ((struct pic32_section *)
				 xmalloc(sizeof(struct pic32_section)));
    
    if (NULL == new) {
	fprintf( stderr, "Fatal Error: Could not build section list\n");
	abort();
    }
    new->sec  = src->sec;
    new->attributes = src->attributes;
    new->file = src->file;
    new->use_vma = src->use_vma;
    new->region = src->region;
    new->pic32_size = src->pic32_size;
    if (NULL != src->children)
	new->children = pic32_copy_section(src->children);
    else
	new->children = NULL;
    return new;

}
*/


/*
** make a copy of a list
** the pic32_sections are recreated but we do not copy the bfd sections ...
*/
static struct pic32_section *
pic32_copy_list (struct pic32_section *src_lst)

{
    struct pic32_section *tail, *s, *dest_lst;
    if (NULL ==src_lst)
	return NULL;
    pic32_init_section_list(&dest_lst);
    tail = dest_lst;
    for (s = src_lst; s != NULL; s = s->next){	    
	/* add s to dest_lst*/
	if (NULL != s->sec) {
	    pic32_append_section_to_list(dest_lst, s->sec);
	    /* advance the tail */
            tail = tail->next;	    
	    tail->attributes = s->attributes;
	    tail->file = s->file;
	    tail->use_vma = s->use_vma;
	    tail->region = s->region;	
	    if (s->children != NULL)
		tail->children = pic32_copy_list (s->children);
	    else  tail->children = NULL;
	    // doing this after the recursive call ensures that the children sizes are computed first.
	    
	    tail->pic32_size = (s->sec->rawsize? s->sec->rawsize : s->sec->size)
		+ pic32_add_sizes(s->children);
	}
    }
    return dest_lst;
}




/*
 * See if a section name matches
 * the unique section list. Truncate
 * section names at the % char, which
 * is used to differentiate orphan sections
 * with the same names.
 */ 
bfd_boolean
pic32_unique_section(const char *s)
{
  struct unique_sections *unam;
  const char *us;

  for (unam = unique_section_list; unam; unam = unam->next) {
    us = unam->name;
    while (*us) {
      if (*us++ != *s++) continue;
      if ((*s == '%') || (*s == '0'))  return TRUE;
    }
  }
  return FALSE;
}

/*
** Length of a section list
*/
int
pic32_section_list_length (lst)
     struct pic32_section *lst;
{
  struct pic32_section *s;
  int count = -1; /* first element is null */

  for (s = lst; s != NULL; s = s->next)
      count++;

  return count;

} /* pic32_section_list_length (..) */

/*
** Print a section list
*/
void
pic32_print_section_list_helper (struct pic32_section *, int);

void
pic32_print_section_list_helper (struct pic32_section *lst, int indent) {
  struct pic32_section *s, *prev, *next;
  prev = lst;
  int j;
  for (s = prev; s != NULL; s = next)
    {
      next = s->next;
      for(j=0;j<indent;j++) LOG(" ");
      if (NULL != s->sec) {
	LOG("  name = %s, addr = %x, len = %d, ",s->sec->name,s->sec->lma,s->pic32_size);
	  //	  if (0 == strcmp(s->sec->name,".text_itcm")) {jimmy debug
	  //    if(s->sec->itcm) printf(" bfd_section has itcm ");  
	  
	  if (NULL != s->sec->output_section) {
	    LOG("oss = %d, ossrs = %d, ",s->sec->output_section->size, s->sec->output_section->rawsize);
	  }
	  LOG(" attr = %x vma = %d init = %d ptr = %lx\n", s->attributes, s->use_vma, s->sec->init, (unsigned long) s->sec);
      }
      else 
	LOG("  N/A \n");
      prev = s;
      if (NULL != s->children) pic32_print_section_list_helper(s->children, indent+4);
    }
}


void
pic32_print_section_list (lst, name)
     struct pic32_section *lst;
      const char *name;
{
  LOG("Contents of %s section list at %p:\n", name, lst);
  pic32_print_section_list_helper(lst,0);

  LOG("\n");

} /* pic32_print_section_list (..) */





/*
** Add a node to a memory list
**  in order of increasing size
*/
void
pic32_add_to_memory_list (lst, addr, size)
     struct pic32_memory *lst;
     bfd_vma addr, size;
{
  struct pic32_memory *new, *b, *prev;
  int done = 0;

  /* create a new element */
  new = ((struct pic32_memory *)
         xmalloc(sizeof(struct pic32_memory)));
  new->addr  = addr;
  new->size  = size;
  new->offset = 0;

  /* insert it at the right spot */
  prev = lst;
  for (b = prev; b != NULL; b = b->next)
    {
      if (new->size < b->size)
        {
          prev->next = new;
          new->next = b;
          done++;
          break;
        }
      prev = b;
    }

  if (!done)
    {
      prev->next = new;
      new->next = NULL;
    }
} /* static void pic32_add_to_memory_list (..) */

/*
** Remove an element from a section list
*/
void
pic32_remove_from_section_list (lst, sec)
     struct pic32_section *lst;
     struct pic32_section *sec;
{
  struct pic32_section *s, *prev, *next;
  int done = 0;

  prev = lst;
  for (s = prev; s != NULL; s = next)
    {
      next = s->next;
      if (s == sec)
        {
          prev->next = next;
          free(s);
          done = 1;
          break;
        }
      prev = s;
    }

  /*
   * If we didn't find it, search for element->section.
   * This enables us to remove an element that was
   * identified from another list.
   *
   * Example: Remove a member of "unassigned sections"
   * that was identified from an allocation list.
   */
  if (!done)
    {
      prev = lst;
      for (s = prev; s != NULL; s = next)
        {
          next = s->next;
          if (s->sec == sec->sec)
            {
              prev->next = next;
              free(s);
              done = 1;
              break;
            }
          prev = s;
        }
    }

  if (done == 0)
    PIC32_DEBUG("    !Could not remove section \"%s\" from list at %lx",
		sec->sec->name, (long unsigned int) &lst);

} /* pic32_remove_from_section_list (..) */


