zeha/xc32/pic32c-source/binutils/ld/mchp/pic32c-emul.c
}


/* anything here may depend on stuff in pic32c-allocate.c. that's just how it is.
   TODO: Maybe not any more.
 */

/* pic32_init_alloc()
 * perform initialization steps for the allocator. this should be called 
 * in ldlang before any BFA-related work is done to identify the 
 * memory configuration. */
void
pic32_init_alloc(void) {

    
  pic32_allocate = pic32_allocate && pic32_init_region_info(&region_info);

  /* XC32E-661: bypass anything dinit-related when called with "-r".
     The lto-wrapper will call us with "-r" to extract some debug info only. */
  if (bfd_link_relocatable (&link_info))
    pic32_data_init = FALSE;
}

void
bfd_pic32_finish (void)
{
  struct bfd_link_hash_entry *h;
  asection *stack_sec = NULL;
  lang_output_section_statement_type *os;

  /* if we've encountered a fatal error, stop here */
  if (config.make_executable == FALSE)
    einfo ("%P%F: Link terminated due to previous error(s).\n");

  /* check for _min_stack_size symbol -- this is an old way to specify
     a stack, and is really not preferred */
  if ((h = bfd_pic32_is_defined_global_symbol ("_min_stack_size")))
    {
      if (pic32_has_stack_option && (h->u.def.value != pic32c_stack_size))
	fprintf (stderr,
		 "Warning: --stack option overrides _min_stack_size symbol\n");
      else
	pic32c_stack_size = h->u.def.value;
    }

  /* if heap is required, make sure one is specified */
  if (pic32_heap_required && !heap_section_defined && !pic32_has_heap_option
      && !bfd_pic32_is_defined_global_symbol ("_min_heap_size"))
    einfo ("%P%X Error: A heap is required, but has not been specified\n");

  /* check for _min_stack_size symbol -- this is an old way to specify
     a stack, and is really not preferred */
  if ((h = bfd_pic32_is_defined_global_symbol ("_min_heap_size")))
    {
      if (pic32_has_heap_option && (h->u.def.value != pic32c_heap_size))
	fprintf (stderr,
		 "Warning: --heap option overrides _min_heap_size symbol\n");
      else
	pic32c_heap_size = h->u.def.value;
    }

  /*
  ** Check for user-defined stack
  **
  ** note: symbol (_stack) must be defined
  */
  if ((h = bfd_pic32_is_defined_global_symbol ("_stack")))
    {
      user_defined_stack = TRUE;
      stack_base = h->u.def.value;
      /* if defined value is relative, add in the section base address */
      if (h->u.def.section && (h->u.def.section != bfd_abs_section_ptr))
	stack_base += h->u.def.section->vma;
    }
  else
    user_defined_stack = FALSE;

  /* If a stack was not defined as a section, or by symbols,
     allocate one from remaining memory */
  if (!user_defined_stack && pic32_allocate)
    {
      allocate_default_stack (region_info.data);

      /*
      ** Set stack symbols for the runtime library
      */
      PIC32_DEBUG("Creating _heap = %x", heap_base);
      _bfd_generic_link_add_one_symbol (&link_info, link_info.output_bfd,
					"_heap", BSF_GLOBAL,
					bfd_abs_section_ptr, heap_base, "_heap",
					1, 0, 0);
      PIC32_DEBUG("Creating _eheap = %x", heap_limit);
      _bfd_generic_link_add_one_symbol (&link_info, link_info.output_bfd,
					"_eheap", BSF_GLOBAL,
					bfd_abs_section_ptr, heap_limit,
					"_eheap", 1, 0, 0);

      PIC32_DEBUG("Creating _splim = %x", stack_base);
      _bfd_generic_link_add_one_symbol (&link_info, link_info.output_bfd,
					"_splim", BSF_GLOBAL,
					bfd_abs_section_ptr, stack_base,
					"_splim", 1, 0, 0);
      _bfd_generic_link_add_one_symbol (&link_info, link_info.output_bfd,
					"_SPLIM", BSF_GLOBAL,
					bfd_abs_section_ptr, stack_base,
					"_SPLIM", 1, 0, 0);

      stack_sec = bfd_get_section_by_name (stack_bfd, ".stack");
      if (stack_sec)
	{
	  etree_type *addr_tree;
	  os = lang_output_section_statement_lookup (".stack", 0, TRUE);
	  stack_sec->size = pic32c_stack_size;
	  if (os->bfd_section != NULL)
	    {
	      bfd_set_section_size (stack_bfd, stack_sec, pic32c_stack_size);
	      bfd_set_section_vma (stack_bfd, stack_sec, stack_base);
	      os->bfd_section->vma = stack_sec->vma;
	      os->bfd_section->lma = stack_sec->lma;
	      os->bfd_section->size = stack_sec->size;
	      stack_sec->flags |= SEC_LINKER_CREATED;
	      os->bfd_section->flags = stack_sec->flags;
	      addr_tree = xmalloc (sizeof (etree_type));
	      addr_tree->value.type.node_class = etree_value;
	      addr_tree->value.value = stack_sec->vma;
	      os->addr_tree = addr_tree;
	      PIC32_DEBUG("Creating _stack = %x", stack_limit);
	      _bfd_generic_link_add_one_symbol (&link_info, stack_sec->owner,
						"_stack", BSF_GLOBAL,
						bfd_abs_section_ptr,
						stack_limit, "_stack", 1, 0, 0);
	    }
	  else
	    fprintf (stderr, "Link Error: Unable to allocate stack\n");
	}
    }

  /* was there a PROVIDE in the linker script to give an alternate name for
   * _stack and _splim? */
  /* see ldexp.c for details */
  if (altNameforStack != NULL)
    {
      PIC32_DEBUG("Creating symbol %s equivalent to _stack",
		  altNameforStack);

      /* MERGE_NOTES: possibly uninitialized stack_sec here. */
      BFD_ASSERT (stack_sec);
      _bfd_generic_link_add_one_symbol (&link_info, stack_sec->owner,
					altNameforStack, BSF_GLOBAL,
					bfd_abs_section_ptr, stack_limit,
					altNameforStack, 1, 0, 0);
      free (altNameforStack);
    }
  if (altNameforSplim != NULL)
    {

      PIC32_DEBUG("Creating symbol %s equivalent to _splim",
		  altNameforSplim);

      /* MERGE_NOTES: possibly uninitialized stack_sec here. */
      BFD_ASSERT (stack_sec);
      _bfd_generic_link_add_one_symbol (&link_info, stack_sec->owner,
					altNameforSplim, BSF_GLOBAL,
					bfd_abs_section_ptr, stack_base,
					altNameforSplim, 1, 0, 0);
      free (altNameforSplim);
    }

  /* if we don't understand the stack, we shouldn't check it. */
  if (stack_limit && stack_base)
    {

      /* Range check the stack, no matter how it was created */
      if ((unsigned int) (stack_limit - stack_base)
	  < (unsigned int) pic32c_stack_size)
	{
	  einfo ("%P%X Error: Not enough memory for stack"
		 " (%u bytes needed, %u bytes available)\n",
		 (unsigned int) (pic32c_stack_size + pic32c_stackguard_size),
		 (unsigned int) ((stack_limit - stack_base)
				 + pic32c_stackguard_size));
	}

