zeha/xc32/pic32c-source/binutils/ld/mchp/pic32c-emul.c
      PIC32_DEBUG("Creating __MIN_STACK_SIZE = %x", pic32c_stack_size);
      _bfd_generic_link_add_one_symbol (&link_info, link_info.output_bfd,
					"__MIN_STACK_SIZE", BSF_GLOBAL,
					bfd_abs_section_ptr, pic32c_stack_size,
					"__MIN_STACK_SIZE", 1, 0, 0);
      PIC32_DEBUG("Creating _min_stack_size = %x", pic32c_stack_size);
      _bfd_generic_link_add_one_symbol (&link_info, link_info.output_bfd,
					"_min_stack_size", BSF_GLOBAL,
					bfd_abs_section_ptr, pic32c_stack_size,
					"_min_stack_size", 1, 0, 0);

      PIC32_DEBUG("Creating __MIN_HEAP_SIZE = %x", pic32c_heap_size);
      _bfd_generic_link_add_one_symbol (&link_info, link_info.output_bfd,
					"__MIN_HEAP_SIZE", BSF_GLOBAL,
					bfd_abs_section_ptr, pic32c_heap_size,
					"__MIN_HEAP_SIZE", 1, 0, 0);
      PIC32_DEBUG("Creating _min_heap_size = %x", pic32c_heap_size);
      _bfd_generic_link_add_one_symbol (&link_info, link_info.output_bfd,
					"_min_heap_size", BSF_GLOBAL,
					bfd_abs_section_ptr, pic32c_heap_size,
					"_min_heap_size", 1, 0, 0);
    }

  /*
   * check if stack should be moved in tcm, if yes, generate the tcm stack
   * symbol
   */
  if (pic32c_stack_in_tcm)
    {
      PIC32_DEBUG("Creating _sdtcm_stack");

      if (pic32_valid_region (region_info.data_tcm))
	{
	  ///\ generate _sdtcm_stack
	  _bfd_generic_link_add_one_symbol (&link_info, link_info.output_bfd,
					    "_sdtcm_stack", BSF_GLOBAL,
					    bfd_abs_section_ptr,
					    dtcm_stack_limit, "_sdtcm_stack", 1,
					    0, 0);
	  // generate _sdtcm_splim
	  _bfd_generic_link_add_one_symbol (&link_info, link_info.output_bfd,
					    "_sdtcm_splim", BSF_GLOBAL,
					    bfd_abs_section_ptr,
					    dtcm_stack_base, "_sdtcm_splim", 1,
					    0, 0);
	}
      ///\ emit symbols with abs address 0
      else
	{
	  // DZ - is this guaranteed to work if there is no DTCM region? or
	  // should it be an error?
	  _bfd_generic_link_add_one_symbol (&link_info, link_info.output_bfd,
					    "_sdtcm_stack", BSF_GLOBAL,
					    bfd_abs_section_ptr, 0x0,
					    "_sdtcm_stack", 1, 0, 0);
	  _bfd_generic_link_add_one_symbol (&link_info, link_info.output_bfd,
					    "_sdtcm_splim", BSF_GLOBAL,
					    bfd_abs_section_ptr, 0x0,
					    "_sdtcm_splim", 1, 0, 0);
	}

      /* was there a PROVIDE in the linker script to give an alternate name for
       * _sdtcm_stack and _sdtcm_splim? */
      /* see ldexp.c for details (and just above ...) */
      if (altNamefor_dtcm_Stack != NULL)
	{

	  PIC32_DEBUG("Creating symbol %s equivalent to _sdtcm_stack",
		      altNamefor_dtcm_Stack);
	  _bfd_generic_link_add_one_symbol (&link_info, stack_sec->owner,
					    altNamefor_dtcm_Stack, BSF_GLOBAL,
					    bfd_abs_section_ptr,
					    dtcm_stack_limit,
					    altNamefor_dtcm_Stack, 1, 0, 0);
	  free (altNamefor_dtcm_Stack);
	}
      if (altNamefor_dtcm_Splim != NULL)
	{

	  PIC32_DEBUG("Creating symbol %s equivalent to _sdtcm_splim",
		      altNamefor_dtcm_Splim);
	  _bfd_generic_link_add_one_symbol (&link_info, stack_sec->owner,
					    altNamefor_dtcm_Splim, BSF_GLOBAL,
					    bfd_abs_section_ptr,
					    dtcm_stack_base,
					    altNamefor_dtcm_Splim, 1, 0, 0);
	  free (altNamefor_dtcm_Splim);
	}
    }

  /*
  ** Set _dinit_addr symbol for data init template
  **   so the C startup module can find it.
  */

  if (pic32_data_init)
    {
      asection *sec;
      sec = init_template->output_section; /* find the template's output sec */

      if (sec)
	{
	  bfd_vma dinit_addr = sec->lma + init_template->output_offset;
	  unsigned int dinit_addr_masked = dinit_addr & 0xFFFFFFFFul;

	  PIC32_DEBUG("Creating _dinit_addr= %x", dinit_addr_masked);
	  _bfd_generic_link_add_one_symbol (&link_info, link_info.output_bfd,
					    "_dinit_addr", BSF_GLOBAL,
					    bfd_abs_section_ptr,
					    dinit_addr_masked, "_dinit_addr", 1,
					    0, 0);
	  PIC32_DEBUG("Creating _dinit_size= %x", dinit_size);
	  _bfd_generic_link_add_one_symbol (&link_info, link_info.output_bfd,
					    "_dinit_size", BSF_GLOBAL,
					    bfd_abs_section_ptr, dinit_size,
					    "_dinit_size", 1, 0, 0);
	}
    }
}

/*
** This routine is called by before_allocation().
**
** Scan a DATA or BSS section and accumulate
** the data template size.
**
** This function must be consistent with bfd_pic32_process_data_section
** in bfd/elf32-pic32c.c, or the size of the dinit template will
** be incorrect.
*/
static void
bfd_pic32_scan_data_section (section, p)
     struct pic32_section *section;
     PTR p;
{
  int *data_size = (int *) p;
  asection *sect = section->sec;

  if (p == (int *) NULL)
    return;

  /* this is only called for sections to be placed in ram/dtcm. we judiciously
     check the data/data_tcm region as appropriate to determine if initialization
     is needed.
     Now this check is done before region info is availible, which involves
     checking section flags.
  */
  if (sect->dtcm)
    {
      BFD_ASSERT(region_info.data_tcm);
      if (!region_info.data_tcm->flags.init_needed)
        {
	  PIC32_DEBUG("  %s (skipped, init_needed = 0), size = %x bytes",
		      sect->name, (unsigned int)sect->size);
          return;
        }
    }
  else
    {
      if (pic32_valid_region(region_info.data) &&
          !region_info.data->flags.init_needed)
        {
	  PIC32_DEBUG("  %s (skipped, init_needed = 0), size = %x bytes",
		      sect->name, (unsigned int)sect->size);
          return;
        }
  }

  /*
  ** skip persistent or noload data sections
  */
  if (PIC32_IS_PERSIST_ATTR(sect) || PIC32_IS_NOLOAD_ATTR(sect))
  {
      /*
      ** issue a warning if DATA values are present
      */
      if ((sect->flags & SEC_DATA) && (sect->size > 0))
        einfo(_("%P: Warning: initial values were specified for a non-loadable"
                " data section (%s). These values will be ignored.\n"),
              sect->name);

      PIC32_DEBUG("scan_data_section %s (skipped, persist/noload), size = %x bytes",
		  sect->name, (unsigned int) sect->size);
      return;
  }

