zeha/xc32/pic32c-source/binutils/ld/mchp/pic32c-emul.c
  /*
  ** process BSS-type sections
  */
  if ((PIC32_SECTION_IS_BSS_TYPE(sect) || PIC32_IS_BSS_ATTR_WITH_MEMORY_ATTR(sect)) &&
      (sect->size > 0))
  {
        *data_size += DATA_RECORD_HEADER_SIZE;
        sect->init = 1;
        PIC32_DEBUG("scan_data_section %s (bss), size = %x bytes, template += %x bytes",
		    sect->name, (unsigned int) sect->size,
		    DATA_RECORD_HEADER_SIZE);
  }

  /*
  ** process DATA-type sections
  */
  if ((PIC32_IS_DATA_ATTR (sect) || PIC32_IS_DATA_ATTR_WITH_MEMORY_ATTR (sect)
       || PIC32_IS_RAMFUNC_ATTR (sect))
      && (sect->size > 0))
    {
      /* account for 0-padding so that new dinit records always start at a
      ** new memory location
      */
      int count
	= (sect->size % 4) ? (sect->size + (4 - sect->size % 4)) : sect->size;
      int delta = DATA_RECORD_HEADER_SIZE + count;
      *data_size += delta;

      /*
      ** make section not LOADable
      */
      sect->flags &= ~SEC_LOAD;
      sect->init = 1;

      PIC32_DEBUG("scan_data_section %s (data), size = %x bytes, template += %x "
		  "bytes\n",
		  sect->name, (unsigned int) sect->size, delta);
    }

} /*static void bfd_pic32_scan_data_section (...)*/

/*
** This routine is called by bfd_pic32_create_data_init_template().
**
** Scan a CODE  sections and accumulate
** the data template size, setting the init flag for things that will
** require initialization.
*/
static void
bfd_pic32_scan_code_section (section, p)
     struct pic32_section *section;
     PTR p;
{
  int *data_size = (int *) p;
  asection *sect = section->sec;

  if (p == (int *) NULL)
    return;

  /* this is only called for TCM code sections assuming they require
     initialization in itcm.. */
  BFD_ASSERT (sect->itcm);
  BFD_ASSERT (region_info.code_tcm);

  if (!region_info.code_tcm->flags.init_needed)
    {
      PIC32_DEBUG("  %s (skipped, init_needed = 0), size = %x bytes",
		  sect->name, (unsigned int) sect->size);
      return;
    }
    
  /*
  ** process CODE-type sections
  */
  if (PIC32_IS_CODE_ATTR(sect) && (sect->size > 0))
  { 
    /* Analyze initialization data now and find out what the after compression
       size of the data initialization template */
    /* account for 0-padding so that new dinit records always start at a
    ** new memory location
    */
    int count = (sect->size % 4) ? (sect->size + (4 - sect->size % 4)) \
                                 : sect->size;
    int delta = DATA_RECORD_HEADER_SIZE + count;
    *data_size += delta;

    /*
    ** make section not LOADable
    */
    sect->flags &= ~SEC_LOAD;

    /* mark for dinit template addition */
    sect->init = 1;

    PIC32_DEBUG("  %s (data), size = %x bytes, template += %x bytes",
		sect->name, (unsigned int) sect->size, delta);
  }
} /*static void bfd_pic32_scan_code_section (...)*/


/*
** Create a bfd for the data init template
**
** Uses the following global variables:
**   symtab
**   symptr
*/
bfd *
bfd_pic32_create_data_init_bfd (parent)
     bfd *parent;
{
  bfd_size_type size;
  bfd *abfd;
  asection *sec;
  char *oname;
  int flags, alignment;

  /* create a bare-bones bfd */
  oname = (char *) bfd_alloc (link_info.output_bfd, 20);
  snprintf (oname, 20, "data_init");
  abfd = bfd_create (oname, parent);
  bfd_find_target (EMULTEMPL.output_format, abfd);
  bfd_make_writable (abfd);

  bfd_set_format (abfd, bfd_object);
  bfd_set_arch_mach (abfd, bfd_arch_arm, 0);
  elf_elfheader(abfd)->e_flags |= EF_ARM_EABI_VER5; /* TODO: Find a better way */

  /* create a symbol table (room for 1 entry) */
  symptr = 0;
  symtab = (asymbol **) bfd_alloc (link_info.output_bfd, 2 * sizeof (asymbol *));

  /*
  ** create a bare-bones section for .dinit
  */
  flags = SEC_CODE | SEC_HAS_CONTENTS | SEC_IN_MEMORY | SEC_KEEP |
          SEC_LINKER_CREATED | SEC_ALLOC | SEC_READONLY;
  alignment = 2; /* 2^2 */
  sec = bfd_pic32_create_section (abfd, ".dinit", flags, alignment);
  size = 0; /* will update later */
  bfd_set_section_size (abfd, sec, size);

  /* put in the symbol table */
  bfd_set_symtab (abfd, symtab, symptr);

  /* will add section contents later */

  /* finish it */
  if (!bfd_make_readable (abfd))
    {
      fprintf( stderr, "Link Error: can't make data init readable\n");
      abort();
    }

  return abfd;
} /* static bfd * bfd_pic32_create_data_init_bfd (...)*/


void pic32_create_fill_templates(void)
{
  struct pic32_fill_option *o;
  if (region_info.code->free_blocks)
    {
      if (pic32_fill_option_list)
        {
         for (o = pic32_fill_option_list; o != NULL; o = o->next)
            {
              if (o == pic32_fill_option_list)
                continue;

              if (o->loc.unused)
                pic32_create_unused_program_sections(o);
            }

        }
     }
   else
     einfo(_("%P: Warning: There is not any free program memory to fill.\n"));
}

static void pic32_create_unused_program_sections
                      (struct pic32_fill_option *opt)
{
  asection * sec;
  struct pic32_memory *b, *next;
  bfd *fill_bfd;
  unsigned char *fill_data;
  struct pic32_section *s;
  bfd_vma size = 0;
  bfd_vma addr = 0;
  int sec_align = 2;

  for (b = region_info.code->free_blocks; b != NULL; b = next)
    {
     next = b->next;
     if ((b->addr == 0) && (b->size == 0))
      continue;
     fill_bfd = bfd_pic32_create_fill_bfd(link_info.output_bfd);
     bfd_pic32_add_bfd_to_link (fill_bfd, fill_bfd->filename);
     
     addr = align_power(b->addr, sec_align); /*align to an instruction word*/
     size = b->size - (addr - b->addr);
    

     fill_bfd->sections->vma = fill_bfd->sections->lma = addr;
     fill_bfd->sections->rawsize = size;
     fill_bfd->sections->size = size;

       /* create a pic32_section */
     pic32_init_section_list(&s);
     s->sec = fill_bfd->sections;
     LANG_FOR_EACH_INPUT_STATEMENT (file)
      {
       if (strcmp(file->filename, fill_bfd->filename) == 0)
        s->file = (PTR) file;
      }
       /* allocate memory for the template */
     fill_data = (unsigned char *) bfd_alloc (link_info.output_bfd, size);
     if (!fill_data)
      {
       fprintf( stderr, "Link Error: not enough memory for fill template\n");
       abort();
      }

       /* fill the template with a default value */
     fill_data = memset(fill_data, 0x11, size);

       /* attach it to the input section */
     sec = bfd_get_section_by_name(fill_bfd, fill_bfd->sections->name);
     if (sec)
      {
       sec->rawsize = size;
       sec->flags |= (SEC_HAS_CONTENTS | SEC_IN_MEMORY | SEC_LOAD | SEC_CODE);
       sec->contents = fill_data;
       bfd_set_section_alignment(fill_bfd, sec, sec_align); /*align to an insn word*/
       bfd_set_section_size (fill_bfd, sec, size);
       fill_bfd->sections = sec;  /* save a copy for later */
      }
     else {
       PIC32_DEBUG("after_open: section %s not found", sec->name);
     }

