zeha/xc32/pic32c-source/binutils/ld/mchp/pic32c-emul.c
     ///\ LG to change looking for execute flag!!!
     // DZ - use identified code region instead
     update_section_info(addr, s, region_info.code);

     pic32_append_section_to_list(opt->fill_section_list, sec);
     pic32_remove_from_memory_list(region_info.code->free_blocks, b);
   }
}

void
pic32_create_specific_fill_sections (void)
{
  asection *sec;
  bfd *fill_bfd;
  unsigned char *fill_data;
  bfd_vma size;
  struct pic32_fill_option *o;

  for (o = pic32_fill_option_list->next; o != NULL; o = o->next)
    {
      if (o->loc.unused)
	continue;

      if (o->loc.end_address)
	size = (o->loc.end_address - o->loc.address) + 1;
      else if (o->fill_width == 1)
	size = 1;
      else if (o->fill_width == 2)
	size = 2;
      else if (o->fill_width == 8)
	size = 8;
      else
	size = 4;

      fill_bfd = bfd_pic32_create_fill_bfd (link_info.output_bfd);
      bfd_pic32_add_bfd_to_link (fill_bfd, fill_bfd->filename);

      fill_bfd->sections->vma = fill_bfd->sections->lma = o->loc.address;
      fill_bfd->sections->rawsize = size;
      fill_bfd->sections->size = size;

      /* allocate memory for the template */
      fill_data = (unsigned char *) bfd_alloc (link_info.output_bfd, size);
      if (!fill_data)
	{
	  fprintf (stderr, "Link Error: not enough memory for fill template\n");
	  abort ();
	}

      /* fill the template with a default value */
      fill_data = memset (fill_data, 0x11, size);

      /* attach it to the input section */
      sec = bfd_get_section_by_name (fill_bfd, fill_bfd->sections->name);
      if (sec)
	{
	  sec->rawsize = size;
	  sec->flags
	    |= (SEC_HAS_CONTENTS | SEC_IN_MEMORY | SEC_LOAD | SEC_CODE);
	  PIC32_SET_ABSOLUTE_ATTR (sec);
	  sec->contents = fill_data;
	  bfd_set_section_size (fill_bfd, sec, size);
	  fill_bfd->sections = sec; /* save a copy for later */
	}
      else
	{
	  PIC32_DEBUG("after_open: section %s not found", sec->name);
	}

      pic32_append_section_to_list (o->fill_section_list, sec);
    }
}

/******************************************
* STACK USAGE ESTIMATION                  *
*******************************************/


/*
* Stack Usage Estimation
* 	check if r_type corresponds to a call semantic
*/
bfd_boolean is_call_reloc(unsigned int r_type)
{
  switch (r_type)
    {
      case R_ARM_CALL:
      case R_ARM_THM_CALL:
      case R_ARM_JUMP24:
      case R_ARM_THM_JUMP19:
      case R_ARM_THM_XPC22:
      case R_ARM_THM_JUMP24:
      case R_ARM_PLT32:
      case R_ARM_TLS_CALL:
      case R_ARM_THM_TLS_CALL:
      /* -mlong-calls and -fpic relocations */
      case R_ARM_ABS32:
      case R_ARM_MOVT_ABS:
      case R_ARM_THM_MOVT_ABS:
      case R_ARM_REL32:
      case R_ARM_MOVT_PREL:
      case R_ARM_THM_MOVT_PREL:
        return TRUE;

      default:
        return FALSE;
    }
}

int32_t
pic32_su_rel_addend (bfd               *abfd,
                     asection          *section,
                     Elf_Internal_Rela *irela,
                     Elf_Internal_Sym  *isym __attribute__((unused)))
{
  int32_t word;
  bfd_boolean rc;

  switch (ELF32_R_TYPE (irela->r_info)) {
    case R_ARM_ABS32:
    case R_ARM_REL32:
      rc = bfd_get_section_contents (abfd, section, &word, irela->r_offset, 4);
      BFD_ASSERT (rc);
      return word;

    default:
      return 0;
  }
}

struct su_section* pic32_su_call_graph_get_create (bfd *abfd, const char *fname);

void pic32_su_add_to_call_graph (bfd *caller_bfd, const char *caller_name, bfd_vma caller_addr,
                            bfd *callee_bfd, const char *callee_name, bfd_vma callee_addr);

static Elf_Internal_Sym *
pic32_su_lookup_callee (vec_type *func_syms,
                        bfd_vma  target_vma)
{
  int in_callee = FALSE;
  int callee_idx = pic32_su_lookup_func (func_syms, 0, target_vma, &in_callee);
  bfd_vma min_d_vma;

  /* if none of the function symbols contains the address, bail out */
  if (!in_callee)
    return NULL;

  /* otherwise, try to see if we can have a better match (from the callee
   * determining perspective) than the first symbol;
   * more precisely, see if one the following symbols starts closer to
   * (ideally exactly at) 'target_vma';
   * NOTE: this is a heuristic added to cater for situations like the
   * following (not normally produced by the compiler but that can appear
   * in hand-written assembly):

    00000000 <__gedf2>:
      0:	f04f 3cff 	mov.w	ip, #4294967295	; 0xffffffff
      4:	e006      	b.n	14 <__cmpdf2+0x4>
      6:	bf00      	nop

    00000008 <__ledf2>:
      8:	f04f 0c01 	mov.w	ip, #1
      c:	e002      	b.n	14 <__cmpdf2+0x4>
      e:	bf00      	nop

    00000010 <__cmpdf2>:
      10:	f04f 0c01 	mov.w	ip, #1
      14:	f84d cd04 	str.w	ip, [sp, #-4]!
      18:	ea4f 0c41 	mov.w	ip, r1, lsl #1
      ...
  */
  min_d_vma = target_vma
                - ST_VALUE2 (VEC (Elf_Internal_Sym *, func_syms, callee_idx));
  if (min_d_vma)
    {
      int idx;
      for (idx = callee_idx + 1; idx != (int) VEC_SIZE (func_syms); ++idx)
        {
          Elf_Internal_Sym *isym = VEC (Elf_Internal_Sym*, func_syms, idx);
          bfd_vma d_vma = target_vma - ST_VALUE2 (isym);

          /* have we exceed the range of possible matches? */
          if ((bfd_signed_vma) d_vma < 0)
            break;

          /* a better match? */
          if (d_vma <= isym->st_size && d_vma < min_d_vma)
            {
              callee_idx = idx;
              min_d_vma = d_vma;

              /* exact even? then stop */
              if (!min_d_vma)
                break;
            }
        }
    }

  return VEC (Elf_Internal_Sym *, func_syms, callee_idx);
}

/* extracts N bits from the 32-bit X value at the S bit position */
static inline uint32_t
ext_bits_32 (uint32_t x, uint8_t s, uint8_t n)
{
  const uint32_t mask = (1U << n) - 1;
  return (x >> s) & mask;
}

/* inserts N BITS into the 32-bit X value at the S bit position */
static inline uint32_t
ins_bits_32 (uint32_t x, uint8_t s, uint8_t n, uint32_t bits)
{
  const uint32_t mask = ((1U << n) - 1) << s;
  return (x & ~mask) | ((bits << s) & mask);
}

