zeha/xc32/pic32c-source/binutils/ld/mchp/pic32c-emul.c
/* returns the 32-bit immediate value encoded in the Thumb B.N (uncond) insn */
static int32_t
thumb_branch_imm32 (uint32_t bits)
{
  const uint32_t imm11 = ext_bits_32 (bits, 0, 11);

  /* sign-extend the lower 11 bits and multiply by 2 */
  return (int32_t) imm11 << 21 >> 20;
}

/* returns the 32-bit immediate value encoded in the Thumb BL/B.W (uncond) insns */
static int32_t
thumb2_branch_imm32 (uint32_t bits)
{
  const uint32_t imm11 = ext_bits_32 (bits, 0, 11);
  const uint32_t imm10 = ext_bits_32 (bits, 16, 10);
  const uint32_t J1    = ext_bits_32 (bits, 13, 1);
  const uint32_t J2    = ext_bits_32 (bits, 11, 1);
  const uint32_t S     = ext_bits_32 (bits, 26, 1);
  const uint32_t I1    = J1 ^ S ^ 1;
  const uint32_t I2    = J2 ^ S ^ 1;
  const uint32_t tmp   = imm11 | (imm10 << 11) | (I2 << 21) | (I1 << 22)
                           | (S << 23);

  /* sign-extend the 24 bits and multiply by 2 */
  return (int32_t) tmp << 8 >> 7;
}

/* returns the 32-bit immediate value encoded in the ARM B/BL insns */
static int32_t
arm_branch_imm32 (uint32_t bits)
{
  const uint32_t imm24 = ext_bits_32 (bits, 0, 24);

  /* sign-extend the lower 24 bits and multiply by 4 */
  return (int32_t) imm24 << 8 >> 6;
}

/* returns the 32-bit immediate value encoded in the ARM BLX(immediate) insn */
static int32_t
arm_branchx_imm32 (uint32_t bits)
{
  const uint32_t imm24 = ext_bits_32 (bits, 0, 24);
  const uint32_t H     = ext_bits_32 (bits, 24, 1);
  const uint32_t tmp   = H | (imm24 << 1);

  /* sign-extend the 25 bits and multiply by 2 */
  return (int32_t) tmp << 7 >> 6;
}

/*
 * Looks for call/jump instructions without relocations in the specified
 * code range (ARM or Thumb) and updates the call graph accordingly.
 */
static void
pic32c_su_calls_wo_relocs_in_range (bfd               *abfd,
                                    Elf_Internal_Shdr *symtab_hdr,
                                    asection          *section,
                                    vec_type          *func_syms,
                                    set_type          *call_relocs_offsets,
                                    const bfd_vma     start_ofs,
                                    const bfd_vma     end_ofs,
                                    int               arm_range)
{
  PIC32_DBG_PRINT ("\t\tprocessing %s range [0x%0X-0x%0X)\n",
                   (arm_range ? "ARM" : "Thumb"), start_ofs, end_ofs);

  int in_fn = FALSE; /* TRUE if inside function FN_IDX */
  int fn_idx = pic32_su_lookup_func (func_syms, 0, start_ofs, &in_fn);
  Elf_Internal_Sym *fn_sym = (fn_idx != (int) VEC_SIZE (func_syms)) ?
    VEC (Elf_Internal_Sym *, func_syms, fn_idx) : NULL;

  /* past the funcs we know from the sym table or in a big
   * (hypothetical, I'm not sure if it's possible) gap? bail out...
   * TODO: set a global "inaccurate" flag? */
  if (!fn_sym || end_ofs <= ST_VALUE2 (fn_sym))
    {
      PIC32_DBG_PRINT ("\t\tno point in scanning the insns ");
      if (fn_sym)
        PIC32_DBG_PRINT ("(next function %s starts at 0x%0X "
                         "and this range ends at 0x%0X)\n",
                         bfd_elf_sym_name (abfd, symtab_hdr, fn_sym, NULL),
                         ST_VALUE2 (fn_sym), end_ofs);
      else
        PIC32_DBG_PRINT ("(no function containing or coming after "
                         "0x%0X found)\n", start_ofs);
      return;
    }

  const char *fn_name = bfd_elf_sym_name (abfd, symtab_hdr, fn_sym, NULL);
  PIC32_DBG_PRINT ("\t\t%s function %s\n\t\t\tinsns:",
                   (in_fn ? "in" : "before"), fn_name);

  /* the next function change will happen at this offset (at the end of the
   * current function or at the beginning of the next one, depending whether
   * we start inside a function or not) */
  bfd_vma next_ofs = in_fn ? ST_VALUE2 (fn_sym) + fn_sym->st_size
                           : ST_VALUE2 (fn_sym);

  const uint8_t *const sec_data = (uint8_t *) section->contents;
  bfd_vma crt_ofs = start_ofs;

  while (crt_ofs < end_ofs)
    {
      /* time to change the function? */
      if (crt_ofs >= next_ofs)
        {
          PIC32_DBG_PRINT ("\n");
          if (in_fn)
            {
next_fn:
              /* we were inside a function until now; advance to next func */
              fn_sym = (++fn_idx != (int) VEC_SIZE (func_syms)) ?
                  VEC(Elf_Internal_Sym *, func_syms, fn_idx) : NULL;

              /* TODO: set a global "inaccurate" flag? */
              if (!fn_sym || end_ofs <= ST_VALUE2 (fn_sym))
                {
                  PIC32_DBG_PRINT ("\t\tno point in scanning more insns ");
                  if (fn_sym)
                    PIC32_DBG_PRINT ("(next function %s starts at 0x%0X "
                                     "and this range ends at 0x%0X)\n",
                                     bfd_elf_sym_name (abfd, symtab_hdr, fn_sym, NULL),
                                     ST_VALUE2 (fn_sym), end_ofs);
                  else
                    PIC32_DBG_PRINT ("(no function containing or coming after "
                                     "0x%0X found)\n", crt_ofs);
                  return;
                }

              /* but check if indeed inside it or in a "gap" */
              if (crt_ofs < ST_VALUE2 (fn_sym))
                {
                  in_fn = FALSE;
                  next_ofs = ST_VALUE2 (fn_sym);
                }
              else
                {
                  /* continue with the next function (there's a small change
                   * that it partially or totally overlaps the crt one) */
                  crt_ofs = ST_VALUE2 (fn_sym);
                  next_ofs = crt_ofs + fn_sym->st_size;

                  /* adjust the new crt ofs if 'start_ofs' is somewhere in the
                   * middle of crt/next function address range (we just want to
                   * scan the insns in the [start_ofs, end_end) range) */
                  if (start_ofs > crt_ofs)
                    crt_ofs = start_ofs;
                }

