zeha/xc32/pic32c-source/binutils/ld/mchp/pic32c-emul.c
              fn_name = bfd_elf_sym_name (abfd, symtab_hdr, fn_sym, NULL);
            }
          else
            {
              /* we were before the function until now;
               * remain on the same func but set 'in_fn' to TRUE */
              BFD_ASSERT (crt_ofs == next_ofs);
              in_fn = TRUE;
              next_ofs += fn_sym->st_size;
            }

          PIC32_DBG_PRINT ("\t\t%s function %s\n\t\t\tinsns:",
                           (in_fn ? "in" : "before"), fn_name);
        }

      uint32_t bits;
      int is_32b;

      if (!arm_range)
        {
          /* for Thumb we need to read the first 16 bits so that we know
          * the size of the insn / how much to advance (even if we just skip it) */
          bits = *(uint16_t *)(sec_data + crt_ofs);

          /* 16- or 32-bit insn? */
          is_32b = ((bits & 0xe000) == 0xe000) && ((bits & 0x1800) != 0);
        }
      else
        {
          /* ARM insns are always 32-bit */
          is_32b = TRUE;
        }


      /* if not in a function, don't process the insn, just dump its size
       * and advance the crt position */
      if (!in_fn)
        {
          PIC32_DBG_PRINT (" %d", 2 << is_32b);
          crt_ofs += 2 << is_32b;
          continue;
        }

      /* process the instruction i.e. try to see if a call/jump to a function */
      int check_target_vma = FALSE;
      bfd_vma target_vma;

      if (arm_range)
        {
          /* ARM32 insn */
          PIC32_DBG_PRINT (" 4");

          bits = *(uint32_t *)(sec_data + crt_ofs);
          crt_ofs += 4;

          const char *opcode = NULL;
          bfd_signed_vma rel_ofs;

          switch (bits & 0xfe000000)
            {
              case 0xea000000: /* B */
              case 0xeb000000: /* BL */
                opcode = (bits & 0x01000000) ? "BL" : "B";
                rel_ofs = arm_branch_imm32 (bits);
                break;
              case 0xfa000000: /* BLX */
              case 0xfb000000:
                opcode = "BLX";
                rel_ofs = arm_branchx_imm32 (bits);
                break;
            }

          if (opcode)
            {
              const bfd_vma insn_vma = crt_ofs - 4;
              target_vma = (insn_vma + 8)/* ARM PC value */ + rel_ofs;

              PIC32_DBG_PRINT ("(%s%+d)", opcode, rel_ofs);

              /* only check the target for branches without relocs
               * (also ignore self-referencing branches / empty loops) */
              check_target_vma = (target_vma != insn_vma)
                && !(call_relocs_offsets
                      && SET_CONTAINS (bfd_vma, call_relocs_offsets, insn_vma));
            }
        }
      else if (!is_32b)
        {
          /* 16-bit Thumb insn */
          PIC32_DBG_PRINT (" 2");

          crt_ofs += 2;

          if ((bits & 0xf800) == 0xe000)              /* B.N */
            {
              const bfd_vma insn_vma = crt_ofs - 2;
              const bfd_signed_vma rel_ofs = thumb_branch_imm32 (bits);

              target_vma = (insn_vma + 4)/* Thumb PC value */ + rel_ofs;

              PIC32_DBG_PRINT ("(B%+d)", rel_ofs);

              /* no relocs for these, so always check the target
               * (that is, unless it's a jump to itself / empty loop
               * as in the dummy handlers) */
              check_target_vma = target_vma != insn_vma;
            }
        }
      else
        {
          /* 32-bit Thumb insn */
          PIC32_DBG_PRINT (" 4");

          bits <<= 16;
          bits |= *(uint16_t *)(sec_data + crt_ofs + 2);
          crt_ofs += 4;

          switch (bits & 0xf800d000)
            {
              case 0xf0009000: /* B.W */
              case 0xf000d000: /* BL */
                {
                  const int is_BL = (bits & 0x4000);
                  const bfd_vma insn_vma = crt_ofs - 4;
                  const bfd_signed_vma rel_ofs = thumb2_branch_imm32 (bits);

                  target_vma = crt_ofs /*PC value=insn_vma + 4*/ + rel_ofs;

                  PIC32_DBG_PRINT ("(%s%+d)", (is_BL ? "BL" : "B"), rel_ofs);

                  /* only check the target for BL/B.W without relocs
                   * (also ignore a possible self-referencing branch /
                   * empty loop, although these usually use B.N) */
                  check_target_vma = (target_vma != insn_vma)
                    && !(call_relocs_offsets
                         && SET_CONTAINS (bfd_vma, call_relocs_offsets, insn_vma));
                }
                break;
            }
        }

      /* check to see if 'target_vma' is the addr of another func
       * from this section */
      if (check_target_vma)
        {
          Elf_Internal_Sym *callee_sym =
            pic32_su_lookup_callee (func_syms, target_vma);

          /* if another function, consider it a callee even if the jump
             is not at its beginning; otherwise, only if the jump is at the
             beginning (for allowing recursive calls but discarding loops) */
          if (callee_sym
              && (callee_sym != fn_sym || target_vma == ST_VALUE2 (callee_sym)))
            {
              const char *callee_name =
                bfd_elf_sym_name (abfd, symtab_hdr, callee_sym, NULL);
              bfd_vma callee_addr = ST_VALUE2 (callee_sym) + section->output_offset +
                                    section->output_section->vma;
              bfd_vma caller_addr = ST_VALUE2 (fn_sym) + section->output_offset +
                                    section->output_section->vma;

              PIC32_DBG_PRINT ("\n\t\t[scanins-based] %s calls %s\n"
                                "\t\t\tinsns:", fn_name, callee_name);

              pic32_su_add_to_call_graph (abfd, fn_name, caller_addr,
                                          abfd, callee_name, callee_addr);
            }
        }
    }
  PIC32_DBG_PRINT ("\n");

  BFD_ASSERT (crt_ofs == end_ofs);

  /* A pretty particular case would be to have two or more overlapping functions
   * with the same end address / equal to the end address of the range - I think
   * using a goto is preferable to totally mess up the above while condition */
  if (in_fn && (fn_idx + 1) < (int) VEC_SIZE (func_syms))
    {
      /* if the next function is also before 'end_ofs', process it as well */
      Elf_Internal_Sym *next_fn = VEC(Elf_Internal_Sym *, func_syms, (fn_idx + 1));
      if (ST_VALUE2 (next_fn) < end_ofs)
        goto next_fn;
    }
}

