zeha/xc32/pic32c-source/binutils/ld/mchp/pic32c-emul.c
/*
 * Looks for call/jump instructions without relocations in the given section
 * and updates the call graph accordingly.
 */
void
pic32c_su_calls_wo_relocs_in_section (bfd               *abfd,
                                      Elf_Internal_Shdr *symtab_hdr,
                                      asection          *section,
                                      Elf_Internal_Rela *relocs,
                                      Elf_Internal_Sym  *isymbuf,
                                      vec_type          *func_syms)
{
  size_t locsymcount;
  Elf_Internal_Sym *isymend, *isym;
  Elf_Internal_Rela *relocsend, *irela;
  int free_contents = FALSE, rc;

  /* process only code sections with contents and not linker created */
  const flagword flags =
    SEC_ALLOC | SEC_LOAD | SEC_READONLY | SEC_CODE | SEC_HAS_CONTENTS;
  if (((section->flags & flags) != flags)
      || (section->flags & SEC_LINKER_CREATED))
    return;

  /* the ARM mapping symbols are local symbols so we need to look
     at the local symbols at the beginning of the sym table */
  locsymcount = symtab_hdr->sh_info;
  if (!locsymcount)
    return;

  /* cache the locations of the call relocs in a set for faster access */
  set_type *call_relocs_offsets = NULL;
  if (relocs && section->reloc_count)
    {
      for (irela = relocs, relocsend = relocs + section->reloc_count;
          irela != relocsend; ++irela)
        {
          if (is_call_reloc (ELF32_R_TYPE (irela->r_info)))
            {
              /* lazy allocation */
              if (!call_relocs_offsets)
                call_relocs_offsets = SET_NEW (bfd_vma);

              PIC32_DBG_PRINT ("\t\tcall reloc at 0x%0X\n", irela->r_offset);
              SET_INSERT (bfd_vma, call_relocs_offsets, irela->r_offset);
            }
        }
    }

  /* we need the section contents loaded into memory */
  if (section->contents == NULL)
    {
      bfd_byte *sec_contents = (bfd_byte *) xmalloc (section->size);
      rc = bfd_get_section_contents (abfd, section, sec_contents,
                                     0, section->size);
      BFD_ASSERT (rc);
      section->contents = sec_contents;

      /* TODO: would it be bad to not free the contents when exiting
       *       this function and set the SEC_IN_MEMORY flag instead? */
      free_contents = TRUE;
    }

  typedef enum {
    SEGT_NONE = 0, SEGT_THUMB = 't', SEGT_DATA = 'd', SEGT_ARM = 'a'
  } seg_t;

  typedef struct segments {
    bfd_vma start_off;
    seg_t type;
  } segments_t;

  int segments_compare(const void *p, const void *q)
  {
    bfd_vma l = ((segments_t *)p)->start_off;
    bfd_vma r = ((segments_t *)q)->start_off;

    return (l - r);
  }

  /* Worst case scenario is to have all the local syms
   * with st_shndx = current_section_index. We will allocate
   * a buffer of segments_t with that size instead of reallocating
   * It is a tradeoff memory vs speed.
   */
  segments_t *section_segments = xmalloc(locsymcount * sizeof(section_segments[0]));
  int i, local_syms_for_section = 0;

  /* get the mapping symbols for this section; first sym is bogus/NULL;
   * go one extra iteration to synthesize an "end section symbol" */
  for (isym = isymbuf + 1, isymend = isymbuf + locsymcount;
       isym <= isymend; ++isym)
    {
      if (isym != isymend)
        {
          if (ELF_ST_TYPE (isym->st_info) != STT_NOTYPE
              || isym->st_size != 0
              || bfd_section_from_elf_index (abfd, isym->st_shndx) != section)
            continue;

          const char *sym_name =
            bfd_elf_sym_name (abfd, symtab_hdr, isym, NULL);

          /* mapping symbol names: $t (Thumb), $d (Data), $a (ARM) */
          if (!sym_name || sym_name[0] != '$' || sym_name[2] != '\0'
              || strchr ("tda", sym_name[1]) == NULL)
            continue;

          section_segments[local_syms_for_section].type = sym_name[1];
          section_segments[local_syms_for_section].start_off = ST_VALUE2 (isym);
          local_syms_for_section++;
        }
      else
        {
          section_segments[local_syms_for_section].type = SEGT_NONE;
          section_segments[local_syms_for_section].start_off = section->size;
          local_syms_for_section++;
        }
    }

    /* sort the section_segments by start_offset so we can build our
     * code intervals where we can search for relocs: [t|a, d|none]
     */
    qsort(section_segments, local_syms_for_section,
          sizeof(section_segments[0]), segments_compare);

    /* Last segment will always be SEGT_NONE with value = section->size */
    for (i = 0; i < local_syms_for_section - 1; i++)
    {
      /* skip the data segments */
      if (section_segments[i].type == SEGT_DATA)
        continue;

      bfd_vma start_offset = section_segments[i].start_off;
      bfd_vma end_offset = section_segments[i + 1].start_off;
      seg_t current_type = section_segments[i].type;
      seg_t next_type = section_segments[i + 1].type;

      /* make sure the current segment ends either when a data
       * segment starts or with end of section (encoded by SEGT_NONE)
       */
      BFD_ASSERT (next_type == SEGT_DATA || next_type == SEGT_NONE);

      pic32c_su_calls_wo_relocs_in_range (abfd, symtab_hdr, section,
                                          func_syms, call_relocs_offsets,
                                          start_offset, end_offset,
                                          current_type == SEGT_ARM);
    }

  free(section_segments);
  section_segments = NULL;

  if (free_contents)
    {
      free (section->contents);
      section->contents = NULL;
    }

  SET_DELETE (call_relocs_offsets);
}

/* Print the memory reports iff a valid license is found
 * and report-mem option was used.
 * Dump the report in map file if a map was specified or at
 * stdout otherwise.
 */
static void print_memory_reports(void)
{
  /* XC32-2375: always put the reports in map file
   * if -Map was provided
   */
  if (config.map_file != NULL)
    {
      bfd_pic32_report_memory_usage (config.map_file);
      bfd_pic32_report_memory_usage_by_module (config.map_file);
    }

  /* No memory report if mafrlcsj was provided */
  if (pic32_mafrlcsj || pic32_mafrlcsj2)
    return;


  /* XC32-2375: dump the memory reports to stdout only
   * if --report-mem is enabled
   */
  if (!pic32_report_mem)
    return;

  bfd_pic32_report_memory_usage (stdout);
  bfd_pic32_report_memory_usage_by_module (stdout);
}

void
pic32c_finish (void)
{
  struct bfd_link_hash_entry * h;

  {
    LANG_FOR_EACH_INPUT_STATEMENT (is)
      {
        /* Figure out where VFP11 erratum veneers (and the labels returning
           from same) have been placed.  */
        bfd_elf32_arm_vfp11_fix_veneer_locations (is->the_bfd, &link_info);

