zeha/xc32/pic32c-source/binutils/ld/mchp/pic32c-emul.c
  struct pic32_section *s;
  lang_memory_region_type *region;

  for (; *region_names; ++region_names)
  {
    if (!lang_memory_region_exist (*region_names))
      continue;

    region = lang_memory_region_lookup (*region_names, FALSE);

    if (!valid_region(region))
      continue;

    for (s = pic32_section_list; s != NULL; s = s->next)
      if (s->sec)
      {
        used_size += bfd_pic32_collect_section_size (s, region);
      }

    total_size += region->length;
  }

  // TCM memory is not included if it's not enabled / zero size
  if (strcmp (memory_name, "tcm") || total_size)
  {
    // NB: the free size is redundant (easily derived from the other two)
    fprintf (memory_summary_file, "    <memory name=\"%s\">\n"
                                  "      <units>bytes</units>\n"
                                  "      <length>%lu</length>\n"
                                  "      <used>%lu</used>\n"
                                  "      <free>%lu</free>\n"
                                  "    </memory>\n",
      memory_name, total_size, used_size, total_size - used_size);
  }
}
#endif

void bfd_pic32_memory_summary(char *arg)
{
  FILE *memory_summary_file = fopen (arg, "w");
  if (memory_summary_file == NULL) {
    fprintf (stderr, "Warning: Could not open %s.\n", arg );
    return;
  }

  /* build an ordered list of output sections */
  pic32_init_section_list (&pic32_section_list);
  bfd_map_over_sections (link_info.output_bfd, &pic32_build_section_list, NULL);

  /*Do not change the output xml format as it might throw the IDE off*/
  fprintf (memory_summary_file, "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n"
                                "<project>\n"
                                "  <executable name=\"%s\">\n", output_filename ); 

  /*Calculate and output memory summary file*/
  /*For now, generate the TCM info only when doing the PRO comparison (i.e. not
    for the regular builds because it messes the memory display in the IDE */
  pic32_report_region_info (memory_summary_file, pic32_mafrlcsj || pic32_mafrlcsj2);

  fprintf (memory_summary_file, "  </executable>\n"
                                "</project>\n");
  fclose (memory_summary_file);
}


#ifdef ENABLE_USER_MEMORY
/*
** Utility routine: bfd_pic32_report_memory_sections()
**
** - show memory usage of sections in user-defined regions
*/ 
static void
bfd_pic32_report_memory_sections (region, sect, fp) 
     const char *region;
     asection *sect;
     FILE *fp;
{
  unsigned long start = sect->vma;
  unsigned int opb = bfd_octets_per_byte (link_info.output_bfd);
  bfd_size_type total = sect->rawsize / opb; /* ignore phantom bytes */

  if (PIC32_IS_MEMORY_ATTR(sect)) {
    const char *c1, *c2;
    struct pic32_section *s;
    unsigned int n;

    /* loop through the list of memory-type sections */
    for (s = user_memory_sections; s != NULL; s = s->next) {
      if (!s->file || !s->sec) continue;
      if (strcmp((char *)s->file, region) != 0) continue;
      
      c1 = (const char *) s->sec;  /* name is stored here! */
      c2 = strchr(c1, '%');        /* avoid the %n terminator */
      n = c2 ? c2 - c1 : strlen(c1);
      if (strncmp(c1, sect->name, n) == 0) {
        char *c, *name = xmalloc(strlen(sect->name) + 1);
        strcpy(name, sect->name);  /* make a local copy of the name */
        c = strchr(name, '%');
        if (c) *c = (char) NULL;   /* remove the %n terminator */
        
        fprintf( fp, "%-24s%#10lx     %#10lx  %10ld \n", name, start, total, total);
 
        external_memory_used += total;
        free(name);
        break;
      }
    }
  }
  return;
} /* static void bfd_pic32_report_memory_sections (...)*/
#endif

/*
** Utility routine: bfd_pic32_collect_section_size()
**
** - calculate memory usage of SEC_ALLOC-flagged sections in memory
*/
bfd_size_type
bfd_pic32_collect_section_size (s, region )
     struct pic32_section *s;
     const lang_memory_region_type *region;
{
  bfd_size_type region_used = 0;
  unsigned long start = s->sec->vma;
  unsigned long load  = s->sec->lma;
  unsigned long actual = s->sec->output_section->size;

  if (PIC32_IS_COHERENT_ATTR(s->sec)) {
    start &= 0xdfffffff;
    load &= 0xdfffffff;
  }
   
  /*
  ** report SEC_ALLOC sections in memory
  */
  if (valid_region(region) &&
      ((s->sec->flags & SEC_ALLOC) && (s->sec->size > 0)))
    {
      if ((start >= region->origin) &&
          ((start + actual) <= (region->origin + region->length)))
      {
         region_used = actual;
      }
      else if ((load >= region->origin) &&
          ((load + actual) <= (region->origin + region->length)) &&
           (s->sec->flags & (SEC_HAS_CONTENTS)))
      {
         region_used = actual;
      }
    }
  return region_used;
} /* static bfd_size_type bfd_pic32_collect_section_size (...) */


static void
report_percent_used (used, max, fp)
     bfd_vma used, max;
     FILE *fp;
{
  double percent;

  if (max > 0) {
     percent = 100 * ((float) used/max);

     if (percent)
       fprintf( fp, "%.1f%% of %#x", percent, max);
     else
       fprintf( fp, "<1%% of %#x", max);
   }
}
// end of code for reporting memory usage


static bfd_boolean
is_section_discarded (asection *s)
{
  return ((s->output_section == NULL
              || s->output_section->owner != link_info.output_bfd)
	      && (s->flags & (SEC_LINKER_CREATED | SEC_KEEP)) == 0);
}

typedef struct llist {
  const char *name;
  bfd_size_type len;
  struct llist *next;
} llist_type;

static void
add_to_seclist (asection* input_sec, llist_type** list_head_ptr)
{
  llist_type *lptr = (llist_type*) malloc(sizeof(llist_type));
  lptr->name = input_sec->name;
  lptr->len = input_sec->size;
  lptr->next = NULL;

  if (*list_head_ptr == NULL)
    *list_head_ptr = lptr;
  else {
    llist_type* llast = *list_head_ptr;
    while (llast->next)
      llast = llast->next;
    llast->next = lptr;
  }
}

static void
freeup_list (llist_type* lptr)
{
  if (lptr == NULL)
    return;
  if (lptr->next)
    freeup_list(lptr->next);
  else
    free(lptr);
}

#define SECTION_NAME_MAP_LENGTH (30)
static void
align_next_column (int len)
{
  if (len >= SECTION_NAME_MAP_LENGTH - 1)
    {
      print_nl ();
      len = 0;
    }
  while (len < SECTION_NAME_MAP_LENGTH)
    {
      print_space ();
      ++len;
    }
}

void
arm_extra_map_file_text (bfd *abfd ATTRIBUTE_UNUSED,
			 struct bfd_link_info *hinfo ATTRIBUTE_UNUSED,
			 FILE *mapf)
{
  if (detailed_mem_usage_to_map == FALSE)
    return;

  fprintf (mapf, _ ("\nInput files and contributions to "
		    "output file."));

  LANG_FOR_EACH_INPUT_STATEMENT (f)
  {
    if ((f->the_bfd->flags & (BFD_LINKER_CREATED | DYNAMIC)) != 0
	|| f->flags.just_syms || f->the_bfd->filename == NULL)
      continue;

    bfd_boolean does_bfd_contribute = FALSE;
    lang_output_section_statement_type *os;

