zeha/xc32/pic32c-source/binutils/ld/mchp/pic32c-emul.c
    for (os = &lang_output_section_statement.head->output_section_statement;
	 os != NULL; os = os->next)
      {
	llist_type *input_seclist_head = NULL;
	asection *output_section = os->bfd_section;

	/* Skip if null or section contains debug info */
	if ((output_section == NULL)
	    || ((output_section->flags & SEC_ALLOC) == 0))
	  continue;

	asection *i;
	bfd_size_type size_from_this_bfd = 0;

	for (i = f->the_bfd->sections; i != NULL; i = i->next)
	  {
	    if ((is_section_discarded (i))
		|| (i->output_section != output_section) || (i->size == 0))
	      continue;

	    add_to_seclist (i, &input_seclist_head);
	    size_from_this_bfd += i->size;
	  }

	if (size_from_this_bfd > 0)
	  {
	    int len;

	    if (does_bfd_contribute == FALSE)
	      {
		does_bfd_contribute = TRUE;
		fprintf (mapf, "\n\n%s\n", f->the_bfd->filename);
	      }

	    minfo ("\n%s", output_section->name);

	    len = strlen (output_section->name);
	    align_next_column (len);
	    minfo ("%W", size_from_this_bfd);
	    minfo ("\t(%s)", os->region->name_list.name);

	    /* Print input sections and size */
	    llist_type *lptr = input_seclist_head;
	    while (lptr)
	      {
		minfo ("\n  %s", lptr->name);
		len = strlen (lptr->name) + 2;
		align_next_column (len);
		minfo ("%W", lptr->len);
		lptr = lptr->next;
	      }
	    freeup_list (input_seclist_head);
	  }
      }
  }
}

/*****************************************************************************
**
** Section List Routines
**
** Maintain a list of sections in order
** of ascending load address.
**
** Used for creating memory usage reports.
**
*/

/*
** check if a list is empty
*/
bfd_boolean pic32_is_empty_list(struct pic32_section* const lst)
{
    if (lst && (lst->sec == 0))
        return TRUE;

    return FALSE;
}

/*
** Add a section to the list
**
** - in order of increasing load address
** - this function is called via bfd_map_over_sections()
*/
void
pic32_build_section_list_vma (abfd, sect, fp)
     bfd *abfd ATTRIBUTE_UNUSED ;
     asection *sect;
     PTR fp ATTRIBUTE_UNUSED ;
{
  struct pic32_section *new, *s, *prev;
  int done = 0;

  /* Already added due to lma */
  if (sect->lma == sect->vma)
    return;

  /* create a new element */
  new = ((struct pic32_section *)
         xmalloc(sizeof(struct pic32_section)));
  if (NULL == new) {
    fprintf( stderr, "Fatal Error: Could not build section list\n");
    abort();
  }
  new->sec  = sect;
  new->attributes = pic32_attribute_map(sect);
  new->file = 0;
  new->use_vma = 1;
  new->pic32_size = sect->size;
  new->region = NULL;
  new->children = NULL;

  /* insert it at the right spot */
  prev = pic32_section_list;
  for (s = prev; s != NULL; s = s->next)
    {
      if (s->sec && (new->sec->vma < s->sec->lma))
        {
          prev->next = new;
          new->next = s;
          PIC32_DEBUG("pic32_build_section_list_vma: Adding %s LMA:%x VMA:%x",
		      new->sec->name,
		      (unsigned int)new->sec->lma,
		      (unsigned int)new->sec->vma);
          done++;
          break;
        }
      prev = s;
    }

  if (!done)
    {
      if (prev) 
        prev->next = new;
      else {
        PIC32_DEBUG("internal error: build_section_list called on uninitialized list");
      }
      new->next = NULL;
    }

} /* static void pic32_build_section_list_vma (...) */

void
pic32_build_section_list (abfd, sect, fp)
     bfd *abfd ATTRIBUTE_UNUSED ;
     asection *sect;
     PTR fp ATTRIBUTE_UNUSED ;
{
  struct pic32_section *new, *s, *prev;
  int done = 0;

  /* the list is used by BFA, so we are interested only in allocatable sections */
  if (!(sect->flags & (SEC_LOAD | SEC_ALLOC)))
    return;

  /* create a new element */
  new = ((struct pic32_section *)
         xmalloc(sizeof(struct pic32_section)));
  if (NULL == new) {
    fprintf( stderr, "Fatal Error: Could not build section list\n");
    abort();
  }
  new->sec  = sect;
  new->attributes = pic32_attribute_map(sect);
  new->file = 0;
  new->use_vma = 0;
  new->pic32_size = sect->size;
  new->region = NULL;
  new->children = NULL;

  /* insert it at the right spot */
  prev = pic32_section_list;
  for (s = prev; s != NULL; s = s->next)
    {
      if (s->sec && (new->sec->lma < s->sec->lma))
        {
          prev->next = new;
          new->next = s;
	  //PIC32_DEBUG("pic32_build_section_list: Adding %s LMA:%x VMA:%x  bfa? %d\n", new->sec->name, (unsigned int)new->sec->lma, (unsigned int)new->sec->vma, new->sec->bfa);
          done++;
          break;
        }
      prev = s;
    }

  if (!done)
    {
      prev->next = new;
      new->next = NULL;
    }
} /* static void pic32_build_section_list (...) */



/*
** return the pic32_section from the given list corresponding to the given bfd section, or NULL.
*/

static struct pic32_section *  find_pic32_sec_from_bfd_section(struct pic32_section *lst, asection *bfd_sec) {

    struct pic32_section *s,  *c;
    if (NULL == lst || NULL == bfd_sec) return NULL;
    for (s = lst; s != NULL; s = s->next) {
	if (NULL == s->sec) continue;
	// comparison of pointers !
	if (s->sec == bfd_sec) return s;
	if (NULL != s->children) {
	    c = find_pic32_sec_from_bfd_section(s->children, bfd_sec);
	    if (c != NULL) return c;
	}
    }
    return NULL;
}





/*
** Search a section list by name
*/
#ifdef ENABLE_USER_MEMORY
static bfd_boolean
pic32_name_in_section_list (lst, name)
     struct pic32_section *lst;
     const char *name;
{
  struct pic32_section *s, *next;
  for (s = lst; s != NULL; s = next) {
    next = s->next;
    if (s->sec && strcmp(s->sec->name, name) == 0)
      return TRUE;
  }
  return FALSE;
}
#endif




/* This is called after all the input files have been opened. */
void
pic32c_after_open (void)
{
  /*
  ** Merge full- and reduced-set I/O functions
  */
  if (pic32_smart_io)
    {
      PIC32_DEBUG("Merging smart-io functions:");

      smartio_merge_symbols ();
    } /* pic32_smart_io */

  emultempl_after_open ();

#ifdef ENABLE_USER_MEMORY
  /* Prepare a list for sections in user-defined regions */
  if (user_memory_sections)
    pic32_free_section_list (&user_memory_sections);
  pic32_init_section_list (&user_memory_sections);
#endif

  {
    /* loop through all of the input bfds */
    LANG_FOR_EACH_INPUT_STATEMENT (is)
    {
      if (!bfd_pic32_process_bfd_after_open (is->the_bfd, &link_info))
	{
	  einfo ("Errors encountered processing file %s\n", is->filename);
	}
    }
  }

  if (!(bfd_link_pic (&link_info) || bfd_link_relocatable (&link_info))
      && !stack_section_defined && (pic32c_stack_size > 0))
    {
      PIC32_DEBUG("Creating stack of size %x", pic32c_stack_size);

      stack_bfd = bfd_pic32_create_stack_bfd (link_info.output_bfd);
      bfd_pic32_add_bfd_to_link (stack_bfd, stack_bfd->filename);
      stack_section_defined = TRUE;
    }
} /* end of pic32c_after_open */

/* Place an orphan section.  We use this to put random SHF_ALLOC
   sections in the right segment.  */

lang_output_section_statement_type *
arm_elf_place_orphan (asection *sec, const char *secname ATTRIBUTE_UNUSED,
		      int constraint ATTRIBUTE_UNUSED)
{
  if (pic32_allocate) 
    {

      if (((sec->flags & SEC_DEBUGGING) == SEC_DEBUGGING)
	  || ((sec->flags & SEC_ALLOC) == 0))
	return NULL; /* let the base code handle non-alloc sections */

      if (!unassigned_sections)
	pic32_init_section_list (&unassigned_sections);

      pic32_append_section_to_list (unassigned_sections, sec);

      /* mark that the section is being placed by the allocator. */
      sec->bfa = 1;

      /* MERGE_NOTES: maybe theres a more sensible thing to return? but the
         idea here is to just return non-NULL since the output section will be
         determined by the BFA. */
      return (lang_output_section_statement_type *) 1; /* and exit */
    }
  else
    {
      return emultempl_place_orphan (sec, secname, constraint);
    }
}
